{
  "mandala": 4,
  "suktas": [
    {
      "sukta": 1,
      "deity_english": "Agni, Varuṇa, Maruts, Sūrya, Ushas",
      "deity_sanskrit": "अग्नि, वरुण, मरुतः, सूर्य, उषस्",
      "rishi_english": "Vāmadeva Gautama",
      "rishi_sanskrit": "वामदेव गौतम",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "त्वां ह्य अग्ने सदम इत समन्यवो देवासो देवम अरतिं नयेरिर इति करत्वा नयेरिरे | अमर्त्यं यजतं मर्त्येष्व आ देवम आदेवं जनत प्रचेतसं विश्वम आदेवं जनत प्रचेतसम ||",
          "sanskrit_iast": "tvāṃ hy aghne sadam it samanyavo devāso devam aratiṃ nyerira iti kratvā nyerire | amartyaṃ yajata martyeṣv ā devam ādevaṃ janata pracetasaṃ viśvam ādevaṃ janata pracetasam ||",
          "english_griffith": "THEE Agni, have the Gods, ever of one accord, sent hither down, a God, appointed messenger, yea, with their wisdom sent thee down. The Immortal, O thou Holy One, mid mortal men, the God-devoted God, the wise, have they brought forth, brought forth the omnipresent God-devoted Sage."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "स भरातरं वरुणम अग्न आ वव्र्त्स्व देवां अछा सुमती यज्ञवनसं जयेष्ठं यज्ञवनसम | रतावानम आदित्यं चर्षणीध्र्तं राजानं चर्षणीध्र्तम ||",
          "sanskrit_iast": "sa bhrātaraṃ varuṇam aghna ā vavṛtsva devāṃ achā sumatī yajñavanasaṃ jyeṣṭhaṃ yajñavanasam | ṛtāvānam ādityaṃ carṣaṇīdhṛtaṃ rājānaṃ carṣaṇīdhṛtam ||",
          "english_griffith": "As such, O Agni, bring with favour to the Gods thy Brother Varuṇa who loveth sacrifice, True to the Law, the Āditya who supporteth men, the King, supporter of mankind."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "सखे सखायम अभ्य आ वव्र्त्स्वाशुं न चक्रं रथ्येव रंह्यास्मभ्यं दस्म रंह्या | अग्ने मर्ळीकं वरुणे सचा विदो मरुत्सु विश्वभानुषु तोकाय तुजे शुशुचान शं कर्ध्य अस्मभ्यं दस्म शं कर्धि ||",
          "sanskrit_iast": "sakhe sakhāyam abhy ā vavṛtsvāśuṃ na cakraṃ rathyeva raṃhyāsmabhyaṃ dasma raṃhyā | aghne mṛḷīkaṃ varuṇe sacā vido marutsu viśvabhānuṣu tokāya tuje śuśucāna śaṃ kṛdhy asmabhyaṃ dasma śaṃ kṛdhi ||",
          "english_griffith": "Do thou, O Friend, turn hither him who is our Friend, swift as a wheel, like two car-steeds in rapid course, Wondrous! to us in rapid course. O Agni, find thou grace for us with Varuṇa, with Maruts who illumine all. Bless us, thou Radiant One, for seed and progeny, yea, bless us, O thou Wondrous God."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "तवं नो अग्ने वरुणस्य विद्वान देवस्य हेळो ऽव यासिसीष्ठाः | यजिष्ठो वह्नितमः शोशुचानो विश्वा दवेषांसि पर मुमुग्ध्य अस्मत ||",
          "sanskrit_iast": "tvaṃ no aghne varuṇasya vidvān devasya heḷo 'va yāsisīṣṭhāḥ | yajiṣṭho vahnitamaḥ śośucāno viśvā dveṣāṃsi pra mumughdhy asmat ||",
          "english_griffith": "Do thou who knowest Varuṇa, O Agni, put far away from us the God's displeasure. Best Sacrificer, brightest One, refulgent remove thou far from us all those who hate us."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "स तवं नो अग्ने ऽवमो भवोती नेदिष्ठो अस्या उषसो वयुष्टौ | अव यक्ष्व नो वरुणं रराणो वीहि मर्ळीकं सुहवो न एधि ||",
          "sanskrit_iast": "sa tvaṃ no aghne 'vamo bhavotī nediṣṭho asyā uṣaso vyuṣṭau | ava yakṣva no varuṇaṃ rarāṇo vīhi mṛḷīkaṃ suhavo na edhi ||",
          "english_griffith": "Be thou, O Agni, nearest us with succour, our closest Friend while now this Morn is breaking. Reconcile to us Varuṇa, be bounteous enjoy the gracious juice; be swift to hear us."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "अस्य शरेष्ठा सुभगस्य संद्र्ग देवस्य चित्रतमा मर्त्येषु | शुचि घर्तं न तप्तम अघ्न्याया सपार्हा देवस्य मंहनेव धेनोः ||",
          "sanskrit_iast": "asya śreṣṭhā subhaghasya saṃdṛgh devasya citratamā martyeṣu | śuci ghṛtaṃ na taptam aghnyāyā spārhā devasya maṃhaneva dhenoḥ ||",
          "english_griffith": "Excellent is the glance, of brightest splendour, which the auspicious God bestows on mortals- The God's glance, longed-for even as the butter, pure, heated, of the cow, the milch-cow's bounty."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "तरिर अस्य ता परमा सन्ति सत्या सपार्हा देवस्य जनिमान्य अग्नेः | अनन्ते अन्तः परिवीत आगाच छुचिः शुक्रो अर्यो रोरुचानः ||",
          "sanskrit_iast": "trir asya tā paramā santi satyā spārhā devasya janimāny aghneḥ | anante antaḥ parivīta āghāc chuciḥ śukro aryo rorucānaḥ ||",
          "english_griffith": "Three are those births, the true, the most exalted, eagerly longed-for, of the God, of Agni. He came invested in the boundless region, pure, radiant, friendly, mightily resplendent."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "स दूतो विश्वेद अभि वष्टि सद्मा होता हिरण्यरथो रंसुजिह्वः | रोहिदश्वो वपुष्यो विभावा सदा रण्वः पितुमतीव संसत ||",
          "sanskrit_iast": "sa dūto viśved abhi vaṣṭi sadmā hotā hiraṇyaratho raṃsujihvaḥ | rohidaśvo vapuṣyo vibhāvā sadā raṇvaḥ pitumatīva saṃsat ||",
          "english_griffith": "This envoy joyeth in all seats of worship, borne on his golden car, sweet-tongued Invoker: Lovely to look on, with red steeds, effulgent, like a feast rich in food, joyous for ever."
        },
        {
          "verse": 9,
          "sanskrit_devanagari": "स चेतयन मनुषो यज्ञबन्धुः पर तम मह्या रशनया नयन्ति | स कषेत्य अस्य दुर्यासु साधन देवो मर्तस्य सधनित्वम आप ||",
          "sanskrit_iast": "sa cetayan manuṣo yajñabandhuḥ pra tam mahyā raśanayā nayanti | sa kṣety asya duryāsu sādhan devo martasya sadhanitvam āpa ||",
          "english_griffith": "Allied by worship, let him give man knowledge: by an extended cord they lead him onward. He stays, effectual in this mortal's dwelling, and the God wins a share in his possessions."
        },
        {
          "verse": 10,
          "sanskrit_devanagari": "स तू नो अग्निर नयतु परजानन्न अछा रत्नं देवभक्तं यद अस्य | धिया यद विश्वे अम्र्ता अक्र्ण्वन दयौष पिता जनिता सत्यम उक्षन ||",
          "sanskrit_iast": "sa tū no aghnir nayatu prajānann achā ratnaṃ devabhaktaṃ yad asya | dhiyā yad viśve amṛtā akṛṇvan dyauṣ pitā janitā satyam ukṣan ||",
          "english_griffith": "Let Agni -for he knows the way- conduct us to all that he enjoys of God-sent riches, What all the Immortals have prepared with wisdom, Dyaus, Sire, Begetter, raining down true blessings."
        },
        {
          "verse": 11,
          "sanskrit_devanagari": "स जायत परथमः पस्त्यासु महो बुध्ने रजसो अस्य योनौ | पर शर्ध आर्त परथमं विपन्यं रतस्य योना वर्षभस्य नीळे ||",
          "sanskrit_iast": "sa jāyata prathamaḥ pastyāsu maho budhne rajaso asya yonau | pra śardha ārta prathamaṃ vipanyaṃ ṛtasya yonā vṛṣabhasya nīḷe ||",
          "english_griffith": "In houses first he sprang into existence, at great heaven's base, and in this region's bosom; Footless and headless, both his ends concealing, in his Bull's lair drawing himself together."
        },
        {
          "verse": 12,
          "sanskrit_devanagari": "सपार्हो युवा वपुष्यो विभावा सप्त परियासो ऽजनयन्त वर्ष्णे | अस्माकम अत्र पितरो मनुष्या अभि पर सेदुर रतम आशुषाणाः ||",
          "sanskrit_iast": "spārho yuvā vapuṣyo vibhāvā sapta priyāso 'janayanta vṛṣṇe | asmākam atra pitaro manuṣyā abhi pra sedur ṛtam āśuṣāṇāḥ ||",
          "english_griffith": "Wondrously first he rose aloft, defiant, in the Bull's lair, the home of holy Order, Longed-for, young, beautiful, and far-resplendent: and seven dear friends sprang up unto the Mighty."
        },
        {
          "verse": 13,
          "sanskrit_devanagari": "अश्मव्रजाः सुदुघा वव्रे अन्तर उद उस्रा आजन्न उषसो हुवानाः ||",
          "sanskrit_iast": "aśmavrajāḥ sudughā vavre antara ud usrā ājann uṣaso huvānāḥ ||",
          "english_griffith": "Here did our human fathers take their places, fain to fulfil the sacred Law of worship. Forth drave they, with loud call, the offering: bright was the morn which they beheld."
        },
        {
          "verse": 14,
          "sanskrit_devanagari": "यथैषा रत्नभवती मर्त्येषु ता तु ववृता मर्त्येषु विश्वा | ये देवा ववृता ऋते जाताः सखाया रत्ना अत्र यजते ||",
          "sanskrit_iast": "yathaīṣā ratnabhavatī martyeṣu tā tu vavṛtā martyeṣu viśvā | ye devā vavṛtā ṛte jātāḥ sakhāyā ratnā atra yajate ||",
          "english_griffith": "Even as those treasures, that abide with mortals, have been secured, so have the Gods prepared them for their worship. Forthwith the Gods have come together, and made them shine as jewels."
        },
        {
          "verse": 15,
          "sanskrit_devanagari": "अग्ने वरुणस्सखे वव्र्त्स्व देवेषु जुष्टे रत्नं यद अस्य | स्वाहा विश्वभानुष्व ब्रह्मणा वावृते यजते ||",
          "sanskrit_iast": "agne varuṇassakhe vavṛtsva deveṣu juṣṭe ratnaṃ yad asya | svāhā viśvabhānuṣva brahmaṇā vāvr̥te yajate ||",
          "english_griffith": "Agni, O Friend of Varuṇa, bring to us the treasure that is in the Gods’ keeping. To the all-shining God, we offer worship with sacrifice."
        },
        {
          "verse": 16,
          "sanskrit_devanagari": "स तु नो अग्ने वरुणस्य विद्वान देवस्य हेळो ऽव यासिसीष्ठाः | यजिष्ठो वह्नितमः शोशुचानो विश्वा दवेषांसि पर मुमुग्ध्य अस्मत ||",
          "sanskrit_iast": "sa tu no aghne varuṇasya vidvān devasya heḷo 'va yāsisīṣṭhāḥ | yajiṣṭho vahnitamaḥ śośucāno viśvā dveṣāṃsi pra mumughdhy asmat ||",
          "english_griffith": "O Agni, thou who knowest Varuṇa, do thou put far away from us the wrath of the God. Brightest and best of sacrificers, dispeller of hate, be gracious to us."
        },
        {
          "verse": 17,
          "sanskrit_devanagari": "स तु नो अग्ने वरुणस्य विद्वान देवस्य हेळो ऽव यासिसीष्ठाः | यजिष्ठो वह्नितमः शोशुचानो विश्वा दवेषांसि पर मुमुग्ध्य अस्मत ||",
          "sanskrit_iast": "sa tu no aghne varuṇasya vidvān devasya heḷo 'va yāsisīṣṭhāḥ | yajiṣṭho vahnitamaḥ śośucāno viśvā dveṣāṃsi pra mumughdhy asmat ||",
          "english_griffith": "This Agni, wise in the ways of Varuṇa, who is the best of sacrificers, may banish all hostile thoughts from us."
        },
        {
          "verse": 18,
          "sanskrit_devanagari": "अस्माकं पितरः सत्यं रतम आशुना यजन्त | विश्वा दवेषांसि पर मुमुग्ध्य अस्मत ||",
          "sanskrit_iast": "asmākaṃ pitaraḥ satyaṃ ṛtam āśunā yajanta | viśvā dveṣāṃsi pra mumughdhy asmat ||",
          "english_griffith": "Our fathers have indeed, with truth, worshipped the Law with swiftness; and all their enmities they have removed."
        },
        {
          "verse": 19,
          "sanskrit_devanagari": "स तु नो अग्ने वरुणस्य विद्वान देवस्य हेळो ऽव यासिसीष्ठाः | यजिष्ठो वह्नितमः शोशुचानो विश्वा दवेषांसि पर मुमुग्ध्य अस्मत ||",
          "sanskrit_iast": "sa tu no aghne varuṇasya vidvān devasya heḷo 'va yāsisīṣṭhāḥ | yajiṣṭho vahnitamaḥ śośucāno viśvā dveṣāṃsi pra mumughdhy asmat ||",
          "english_griffith": "Agni, bring to us with favour all the gifts of the Gods, even the treasures of Varuṇa and the radiant Maruts."
        },
        {
          "verse": 20,
          "sanskrit_devanagari": "स तु नो अग्ने वरुणस्य विद्वान देवस्य हेळो ऽव यासिसीष्ठाः | यजिष्ठो वह्नितमः शोशुचानो विश्वा दवेषांसि पर मुमुग्ध्य अस्मत ||",
          "sanskrit_iast": "sa tu no aghne varuṇasya vidvān devasya heḷo 'va yāsisīṣṭhāḥ | yajiṣṭho vahnitamaḥ śośucāno viśvā dveṣāṃsi pra mumughdhy asmat ||",
          "english_griffith": "Thus let Agni, the wise one, favour us, and put far away all enmity; the god devoted to sacrifice is our friend."
        }
      ]
    },
    {
      "mandala": 4,
      "sukta": 14,
      "deity_english": "Agni, Savitar, Ashvins, Ushas, Surya",
      "deity_sanskrit": "अग्नि, सवितृ, अश्विनौ, उषस्, सूर्य",
      "rishi_english": "Vāmadeva Gautama",
      "rishi_sanskrit": "वामदेव गौतम",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "यो मर्त्येष्व अम्र्त रतावा देवो देवेष्व अरतिर निधायि | होता यजिष्ठो मह्ना शुचध्यै हव्यैर अग्निर मनुष ईरयध्यै ||",
          "sanskrit_iast": "yo martyeṣv amṛta ṛtāvā devo deveṣv aratir nidhāyi | hotā yajiṣṭho mahnā śucadhyai havyair aghnir manuṣa īrayadhyai ||",
          "english_griffith": "The Faithful One, Immortal among mortals, a God among the Gods, appointed envoy, Priest, best at worship, must shine forth in glory. Agni shall be raised high with man's oblations."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "इह तवं सूनो सहसो नो अद्य जातो जातां उभयां अन्तर अग्ने | दूत ईयसे युयुजान रष्व रजुमुष्कान वर्षणः शुक्रांश च ||",
          "sanskrit_iast": "iha tvaṃ sūno sahaso no adya jāto jātāṃ ubhayāṃ antar aghne | dūta īyase yuyujāna ṛṣva ṛjumuṣkān vṛṣaṇaḥ śukrāṃś ca ||",
          "english_griffith": "Born for us here this day, O Son of Vigour, between both races of born beings, Agni, thou farest as an envoy, having harnessed, Sublime One! thy strong-muscled radiant stallions."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "अत्या वर्धस्नू रोहिता घर्तस्नू रतस्य मन्ये मनसा जविष्ठा | अन्तर ईयसे अरुषा युजानो युष्मांश च देवान विश आ च मर्तान ||",
          "sanskrit_iast": "atyā vṛdhasnū rohitā ghṛtasnū ṛtasya manye manasā javiṣṭhā | antar īyase aruṣā yujāno yuṣmāṃś ca devān viśa ā ca martān ||",
          "english_griffith": "I laud the ruddy steeds who pour down blessing, dropping oil, fleet through the thoualit of Order. Yoking red horses to and fro thou goest between the Deities and mortal races."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "अर्यमणं वरुणमित्रमेषामिन्द्राविष्णूमरुतोअश्विनोत | सवश्वोअग्ने सुरथः सुराधा एदुवहसहविषेजनाय ||",
          "sanskrit_iast": "aryamaṇaṃ varuṇam mitram eṣām indrāviṣṇū maruto aśvinota | svaśvo aghne surathaḥ surādhā edu vaha suhaviṣe janāya ||",
          "english_griffith": "Aryaman, Mitra, Varuṇa, and Indra with Viṣṇu, of the Gods, Maruts and Aśvins — these, Agni, with good car and steeds, bring hither, most bountiful, to folk with fair oblations."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "गोमांअग्नेऽविमाश्वी यज्ञो नर्वत्सखा सदमिद अप्र्म्ष्यः | इळावां एषोअसुर प्रजावान दीर्घोरयिः पर्थुबुध्नः सभावान ||",
          "sanskrit_iast": "gomāṃ aghne 'vimā śvī yajño nṛvatsakhā sadam ida apramṛṣyaḥ | iḷāvāṃ eṣo asura prajāvān dīrgho rayiḥ pṛthubudhnaḥ sabhāvān ||",
          "english_griffith": "Agni, be this our sacrifice eternal, with brave friends, rich in kine and sheep and horses, rich, Asura! in sacred food and children, in full assembly, wealth broad-based and enduring."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "यसतिध्मं जभरत सिष्विदानो मूर्धानं वा ततपते त्वया | भुवस्तस्य सवतः पायुरअग्ने विश्वस्मात्सीमअघायतुरुष्य ||",
          "sanskrit_iast": "yas tidhmaṃ jabharat siṣvidāno mūrdhānaṃ vā tatapate tvayā | bhuvas tasya savataḥ pāyur aghne viśvasmāt sīm aghāyatur uruṣya ||",
          "english_griffith": "The man who, sweating, brings for thee the fuel, and makes his head to ache, thy faithful servant, — Agni, to him be a self-strong Protector; guard him from all who seek to do him mischief."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "यसतेभरादन्नियते चिदन्नंनिशिषनमन्द्रमतिथिमुदीरत | आदेवयुरिनधतेदुरोणे तस्मिनरयिर्ध्रुवोअस्तुदास्वान ||",
          "sanskrit_iast": "yas te bharād anniyate cid annaṃ niśiṣan mandram atithim udīrat | ā devayur inadhate duroṇe tasmin rayir dhruvo astu dāsvān ||",
          "english_griffith": "Who brings thee food, though thou hast food in plenty, welcomes his cheerful guest and speeds him onward, who kindles thee devoutly in his dwelling — to him be wealth secure and freely giving."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "यस त्वा दोषा य उषसि परशंसात परियं वा त्वा कर्णवते हविष्मान | अश्वो न सवे दम आ हेम्यावान तम अंहसः पीपरो दाश्वांसम ||",
          "sanskrit_iast": "yas tvā doṣā ya uṣasi praśaṃsāt priyaṃ vā tvā kṛṇavate haviṣmān | aśvo na sve dama ā hemyāvān tam aṃhasaḥ pīparo dāśvāṃsam ||",
          "english_griffith": "Whoso sings praise to thee at eve or morning, and, with oblation, doth the thing thou lovest — in his own home, even as a gold-girt courser, rescue him from distress, the bounteous giver."
        },
        {
          "verse": 9,
          "sanskrit_devanagari": "यस तुभ्यमग्ने अम्र्ताय दाशदुवस त्वे कर्णवते यतस्रुक | न स राया शशमानो वि योषन नैनम अंहः परि वरद अघायोः ||",
          "sanskrit_iast": "yas tubhyam aghne amṛtāya dāśad duvas tve kṛṇavate yatasruk | na sa rāyā śaśamāno vi yoṣan nainam aṃhaḥ pari varad aghāyoḥ ||",
          "english_griffith": "Whoso brings gifts to thee Immortal, Agni, and doth thee service with uplifted ladle, let him not, sorely toiling, lose his riches; let not the sinner's wickedness enclose him."
        },
        {
          "verse": 10,
          "sanskrit_devanagari": "यस्य तवमग्ने अध्वरं जुजोषो देवो मर्तस्य सुधितं रराणः | परीतेद असद धोत्रा सा यविष्ठासाम यस्य विधतो वर्धासः ||",
          "sanskrit_iast": "yasya tvam aghne adhvaraṃ jujoṣo devo martasya sudhitaṃ rarāṇaḥ | prīted asad dhotrā sā yaviṣṭhāsāma yasya vidhato vṛdhāsaḥ ||",
          "english_griffith": "Whose well-wrought worship thou acceptest, Agni, thou God a mortal's gift, thou liberal Giver, dear be his sacrifice to thee, Most Youthful! and may we strengthen him when he adores thee."
        },
        {
          "verse": 11,
          "sanskrit_devanagari": "चित्तिमअचित्तिं चिनवद्वि विद्वान पर्ष्ठेव वीता वर्जिनाचर्तान | राये च नः सवपत्याय देव दितिं च रास्वादितिम उरुष्य ||",
          "sanskrit_iast": "cittim acittiṃ cinavad vi vidvān pṛṣṭheva vītā varjinā chartān | rāye ca naḥ svapatyāya deva ditiṃ ca rāsvāditim uruṣya ||",
          "english_griffith": "May he who knows distinguish sense and folly of men, like straight and crooked backs of horses, lead us, O God, to wealth and noble offspring; keep penury afar and grant us plenty."
        },
        {
          "verse": 12,
          "sanskrit_devanagari": "कविं शशासुः कवयोऽदब्धा निधारयन्तोदुर्यास्व आयोः | अतस्तवं दर्श्यांअघ्ने एतानपद्भिः पश्येर अद्भुतां अर्य एवैः ||",
          "sanskrit_iast": "kaviṃ śaśāsuḥ kavayo 'dabdhā nidhārayanto duryāsva āyoḥ | atas tvaṃ dṛśyāṃ aghne etān padbhiḥ paśyer adbhutāṃ arya evaiḥ ||",
          "english_griffith": "This Sage the Sages, ne’er deceived, commanded, setting him down in dwellings of the living. Hence mayst thou, friendly God, with rapid footsteps behold the Gods, wonderful, fair to look on."
        },
        {
          "verse": 13,
          "sanskrit_devanagari": "तवमग्ने वाघते सुप्रणीतिः सुतसोमाय विधते यविष्ठ | रत्नं भर शशमानाय घर्ष्वे पर्थु शचन्द्रम अवसे चर्षणिप्राः ||",
          "sanskrit_iast": "tvam aghne vāghate supraṇītiḥ sutasomāya vidhate yaviṣṭha | ratnaṃ bhara śaśamānāya ghṛṣve pṛthu ścandram avase carṣaṇiprāḥ ||",
          "english_griffith": "Good guidance hast thou for the priest, O Agni, who, Youngest God! with outpoured Soma serves thee. Ruler of men, thou joyous God, bring treasure splendid and plentiful to aid the toiler."
        },
        {
          "verse": 14,
          "sanskrit_devanagari": "अधा ह यद वयम अग्ने तवाया पद्भिर हस्तेभिश्चक्र्मा तनूभिः | रथं न करन्तो अपसा भुरिजोर रतं येमुः सुध्य आशुषाणाः ||",
          "sanskrit_iast": "adhā ha yad vayam aghne tavayā padbhir hastebhiś cakṛmā tanūbhiḥ | rathaṃ na karanto apasā bhurijor ṛtaṃ yemuḥ sudhya āśuṣāṇāḥ ||",
          "english_griffith": "Now all that we, thy faithful servants, Agni, have done with feet, with hands, and with our bodies, the wise, with toil, the holy rite have guided, as those who frame a car with manual cunning."
        },
        {
          "verse": 15,
          "sanskrit_devanagari": "अधा मातुर उषसः सप्त विप्रा जायेमहि प्रथमा वेधसो नृण | दिवसपुत्रा अङगिरसो भवेमाद्रिं रुजेम धनिनं शुचन्तः ||",
          "sanskrit_iast": "adhā mātur uṣasaḥ sapta viprā jāyemahi prathamā vedhaso nṝn | divasaputrā aṅgiraso bhavemādriṃ rujema dhaninaṃ śucantaḥ ||",
          "english_griffith": "May we, seven sages first in rank, engender, from Dawn the Mother, men to be ordainers. May we, Aṅgirases, be sons of Heaven, and, radiant, burst the wealth-containing mountain."
        },
        {
          "verse": 16,
          "sanskrit_devanagari": "अधा यथा नः पितरः परासः परत्नासो अग्न रतम आशुषाणाः | शुचीद अयन दीधितिम उक्थशासः क्षामा भिन्दन्तो अरुणीर अप वरन ||",
          "sanskrit_iast": "adhā yathā naḥ pitaraḥ parāsaḥ pratnāso aghna ṛtaṃ āśuṣāṇāḥ | śucīd ayana dīdhitim ukthaśāsaḥ kṣāmā bhindanto aruṇīr apa varan ||",
          "english_griffith": "As in the days of old our ancient Fathers, speeding the work of holy worship, Agni, sought pure light and devotion, singing praises; they cleft the ground and made red Dawns apparent."
        },
        {
          "verse": 17,
          "sanskrit_devanagari": "सुकर्माणः सुरुचो देवयन्तोऽयो न देवा जनिमा धमन्तः | शुचन्तो अग्निं ववर्धन्त इन्द्रं ऊर्वं गव्यम परिषदन्तो अग्मन् ||",
          "sanskrit_iast": "sukarmāṇaḥ suruco devayanto 'yo na devā janimā dhamantaḥ | śucanto aghniṃ vavṛdhanta indraṃ ūrvaṃ gavyam pariṣadanto aghman ||",
          "english_griffith": "Gods, doing holy acts, devout, resplendent, smelting like ore their human generations, enkindling Agni and exalting Indra, they came encompassing the stall of cattle."
        },
        {
          "verse": 18,
          "sanskrit_devanagari": "आ यूथेव क्षुमति पश्वो अख्यद देवानां यज जनिमान्त्य उग्र | मर्तानां चिद उर्वशीः अक्र्प्रन वर्धे चिद अर्य उपरस्यायोः ||",
          "sanskrit_iast": "ā yūtheva kṣumati paśvo akhyad devānāṃ yaj janimānty ughra | martānāṃ cid urvaśīḥ akṛpraṇa vṛdhe cid arya uparasyāyoḥ ||",
          "english_griffith": "Strong One! he marked them—and the Gods before them—like herds of cattle in a foodful pasture. There they moaned forth their strong desire for mortals, to aid the True, the nearest One, the Living."
        },
        {
          "verse": 19,
          "sanskrit_devanagari": "अकर्म ते सवपसो अभूम रतम अवस्रन्न उषसो विभातीः | अनूनम अग्निम पुरुधा सुश्चन्द्रं देवस्य मर्म्जतश चारु चक्षुः ||",
          "sanskrit_iast": "akarma te svapaso abhūma ṛtaṃ avasrann uṣaso vibhātīḥ | anūnam aghnim purudhā suścandraṃ devasya marmṛjataś cāru cakṣuḥ ||",
          "english_griffith": "We have worked for thee, we have laboured nobly—bright Dawns have shed their light upon our worship—adding a beauty to the perfect Agni, and the God's beauteous eye that shines for ever."
        },
        {
          "verse": 20,
          "sanskrit_devanagari": "एता ते अग्न उचथानि वेधोऽवोचाम कवये ता जुषस्व | उच छोचस्व कर्णुहि वस्यसो नो महो रायः पुरुवार पर यन्धि ||",
          "sanskrit_iast": "etā te aghna ucathāni vedho 'vocāma kavaye tā juṣasva | uc chocasva kṛṇuhi vasyaso no maho rāyaḥ puruvāra pra yandhi ||",
          "english_griffith": "Agni, Disposer, we have sung these praises to thee the Wise: do thou accept them gladly. Blaze up on high and ever make us richer. Give us great wealth, O thou whose boons are many."
        }
      ]
    },
    {
      "mandala": 4,
      "sukta": 3,
      "deity_english": "Agni, Rudra",
      "deity_sanskrit": "अग्नि, रुद्र",
      "rishi_english": "Vāmadeva Gautama",
      "rishi_sanskrit": "वामदेव गौतम",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "आ वो राजानम अध्वरस्य रुद्रं होतारं सत्ययजं रोदस्योः |\nअग्निम पुरा तनयित्नोर अचित्ताद धिरण्यरूपम अवसे कर्णुध्वम ||",
          "sanskrit_iast": "ā vo rājānam adhvarasya rudraṃ hotāraṃ satyayajaṃ rodasyoḥ |\naghnim purā tanayitnor acittād dhiraṇyarūpam avase karṇudhvam ||",
          "english_griffith": "WIN, to assist you, Rudra, Lord of worship, Priest of both worlds, effectual Sacrificer, Agni, invested with his golden colours, before the thunder strike and lay you senseless."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "अयं योनिश चक्र्मा यं वयं ते जायेव पत्य उशती सुवासाः |\nअर्वाचीनः परिवीतो नि षीदेमा उ ते सवपाक परतीचीः ||",
          "sanskrit_iast": "ayaṃ yoniś cakṛmā yaṃ vayaṃ te jāyeva patya uśatī suvāsāḥ |\narvāchīnaḥ parivīto ni ṣīdemā u te svapāka pratīcīḥ ||",
          "english_griffith": "This shrine have we made ready for thy coming, as the fond dame attires her for her husband."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "आश्र्ण्वते अद्र्पिताय मन्म नर्चक्षसे सुम्र्ळीकाय वेधः |\nदेवाय शस्तिम अम्र्ताय शंस गरावेव सोता मधुषुद यम ईळे ||",
          "sanskrit_iast": "āśṛṇvate adṛpitāya manma nṛcakṣase sumṛḷīkāya vedhaḥ |\ndevāya śastim amṛtāya śaṃsa garāveva sotā madhuṣud yam īḷe ||",
          "english_griffith": "A hymn, O Priest, to him who hears, the gentle, to him who looks on men, exceeding gracious."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "तवं चिन नः शम्या अग्ने अस्या रतस्य बोध्य रतचित सवाधीः |\nकदा त उक्था सधमाद्यानि कदा भवन्ति सख्या गर्हे ते ||",
          "sanskrit_iast": "tvaṃ cin naḥ śamyā aghne asyā ṛtasya bodhya ṛtacit svādhīḥ |\nkadā ta ukthā sadhamādyāni kadā bhavanti sakhyā ghṛhe te ||",
          "english_griffith": "Even as true knower of the Law, O Agni, to this our solemn rite be thou attentive."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "कथा ह तद वरुणाय तवम अग्ने कथा दिवे गर्हसे कन न आगः |\nकथा मित्राय मीळ्हुषे पर्थिव्यै बरवः कद अर्यम्णे कद भगाय ||",
          "sanskrit_iast": "kathā ha tad varuṇāya tvam aghne kathā dive gharhase kan na āghaḥ |\nkathā mitrāya mīḷhuṣe pṛthivyai bravaḥ kad aryamṇe kad bhaghāya ||",
          "english_griffith": "When shall thy songs of festival be sung thee? When is thy friendship shown within our dwelling?"
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "कद धिष्ण्यासु वर्धसानो अग्ने कद वाताय परतवसे शुभंये |\nपरिज्मने नासत्याय कषे बरवः कद अग्ने रुद्राय नर्घ्ने ||",
          "sanskrit_iast": "kad dhiṣṇyāsu vṛdhasāno aghne kad vātāya pratavase śubhaṃye |\nparijmane nāsatyāya kṣe bravaḥ kad aghne rudrāya nṛghne ||",
          "english_griffith": "Why this complaint to Varuṇa, O Agni? And why to Heaven? for what is our transgression?"
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "कथा महे पुष्टिम्भराय पूष्णे कद रुद्राय सुमखाय हविर्दे |\nकद विष्णव उरुगायाय रेतो बरवः कद अग्ने शरवे बर्हत्यै ||",
          "sanskrit_iast": "kathā mahe puṣṭimbharāya pūṣṇe kad rudrāya sumakhāya havirde |\nkad viṣṇava urughāyāya reto bravaḥ kad aghne śarave bṛhatyai ||",
          "english_griffith": "How wilt thou speak to Earth and bounteous Mitra? What wilt thou say to Aryaman and Bhaga?"
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "कथा शर्धाय मरुताम रताय कथा सूरे बर्हते पर्छ्यमानः |\nपरति बरवो ऽदितये तुराय साधा दिवो जातवेदश चिकित्वान ||",
          "sanskrit_iast": "kathā śardhāya marutām ṛtāya kathā sūre bṛhate pṛchyamānaḥ |\nprati bravo 'ditaye turāya sādhā divo jātavedaś cikitvān ||",
          "english_griffith": "What, when thou blazest on the lesser altars, what to the mighty Wind who comes to bless us?"
        },
        {
          "verse": 9,
          "sanskrit_devanagari": "रतेन रतं नियतम ईळ आ गोर आमा सचा मधुमत पक्वम अग्ने |\nकर्ष्णा सती रुशता धासिनैषा जामर्येण पयसा पीपाय ||",
          "sanskrit_iast": "ṛtena ṛtaṃ niyatam īḷa ā ghor āmā sacā madhumat pakvam aghne |\nkṛṣṇā satī ruśatā dhāsinaiṣā jāmaryeṇa payasā pīpāya ||",
          "english_griffith": "Before the Free, before the Swift, defend us: fulfil heaven's work, all-knowing Jātavedas."
        },
        {
          "verse": 10,
          "sanskrit_devanagari": "रतेन हि षमा वर्षभश चिद अक्तः पुमां अग्निः पयसा पर्ष्ठ्य्न |\nअस्पन्दमानो अचरद वयोधा वर्षा शुक्रं दुदुहे पर्श्निर ऊधः ||",
          "sanskrit_iast": "ṛtena hi ṣmā vṛṣabhaś cid aktaḥ pumāṃ aghniḥ payasā pṛṣṭhyna |\naspandamāno acarad vayodhā vṛṣā śukraṃ duduhe pṛśnir ūdhaḥ ||",
          "english_griffith": "I crave the cow's true gift arranged by Order: though raw, she hath the sweet ripe juice, O Agni."
        },
        {
          "verse": 11,
          "sanskrit_devanagari": "रतेनाद्रिं वय असन भिदन्तः सम अङगिरसो नवन्त गोभिः |\nशुनं नरः परि षदन्न उषासम आविः सवर अभवज जाते अग्नौ ||",
          "sanskrit_iast": "ṛtenādriṃ vya sana bhidantaḥ sam aṅgiraso navanta gobhiḥ |\nśunaṃ naraḥ pari ṣadann uṣāsam āviḥ svar abhavaj jāte aghnau ||",
          "english_griffith": "Though she is black of hue with milk she teemeth, nutritious, brightly shining, all-sustaining."
        },
        {
          "verse": 12,
          "sanskrit_devanagari": "रतेन देवीर अम्र्ता अम्र्क्ता अर्णोभिर आपो मधुमद्भिर अग्ने |\nवाजी न सर्गेषु परस्तुभानः पर सदम इत सरवितवे दधन्युः ||",
          "sanskrit_iast": "ṛtena devīr amṛtā amṛktā arṇobhir āpo madhumadbhir aghne |\nvājī na sargheṣu prastubhānaḥ pra sadam it sravitave dadhanyuḥ ||",
          "english_griffith": "By Law the Immortal Goddesses the Waters, with meath-rich waves, O Agni, and uninjured."
        },
        {
          "verse": 13,
          "sanskrit_devanagari": "मा कस्य यक्षं सदम इद धुरो गा मा वेशस्य परमिनतो मापेः |\nमा भरातुर अग्ने अन्र्जोर रणं वेर मा सख्युर दक्षं रिपोर भुजेम ||",
          "sanskrit_iast": "mā kasya yakṣaṃ sadam ida dhuro gā mā veśasya paraminato māpeḥ |\nmā bharātur aghne anṛjor raṇaṃ ver mā sakhyur dakṣaṃ ripor bhujema ||",
          "english_griffith": "Go never to the feast of one who harms us, the treacherous neighbour or unworthy kinsman."
        },
        {
          "verse": 14,
          "sanskrit_devanagari": "रक्षा णो अग्ने तव रक्षणेभी रारक्षाणः सुमख परीणानः |\nपरति षफुर वि रुज वीड्व अंहो जहि रक्षो महि चिद वाव्र्धानम ||",
          "sanskrit_iast": "rakṣā ṇo aghne tava rakṣaṇebhī rārakṣāṇaḥ sumakha parīṇānaḥ |\nprati ṣphura vi ruja vīḍv aṃho jahi rakṣo mahi cid vāvṛdhānam ||",
          "english_griffith": "Punish us not for a false brother's trespass. Let us not feel the might of friend or foeman."
        },
        {
          "verse": 15,
          "sanskrit_devanagari": "एभिर भव सुमना अग्ने अर्कैर इमान सप्र्श मन्मभिः शूर वाजान |\nउत बरह्माण्य अङगिरो जुषस्व सं ते शस्तिर देववाता जरेत ||",
          "sanskrit_iast": "ebhir bhava sumanā aghne arkair imān spṛśa manmabhiḥ śūra vāgān |\nuta brahmāṇy aṅghiro juṣasva saṃ te śastir devavātā jareta ||",
          "english_griffith": "O Agni, keep us safe with thy protection, loving us, honoured God! and ever guarding."
        },
        {
          "verse": 16,
          "sanskrit_devanagari": "एता विश्वा विदुषे तुभ्यं वेधो नीथान्य अग्ने निण्या वचांसि |\nनिवचना कवये काव्यान्य अशंसिषम मतिभिर विप्र उक्थैः ||",
          "sanskrit_iast": "etā viśvā viduṣe tubhyaṃ vedho nīthāny aghne niṇyā vacāṃsi |\nnivacanā kavaye kāvyāny aśaṃsiṣam matibhir vipra ukthaiḥ ||",
          "english_griffith": "Through these our songs of praise be gracious, Agni; moved by our prayers, O Hero, touch our viands."
        }
      ]
    },
    {
      "sukta": 4,
      "deity_english": "Agni",
      "deity_sanskrit": "अग्नि",
      "rishi_english": "Vāmadeva",
      "rishi_sanskrit": "वामदेव",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "कर्णुष्व पाजः परसितिं न पर्थ्वीं याहि राजेवामवां इभेन |\nतर्ष्वीम अनु परसितिं दरूणानो ऽसतासि विध्य रक्षसस तपिष्ठैः ||",
          "sanskrit_iast": "kṛṇuṣva pājaḥ prasitiṃ na pṛthvīṃ yāhi rājevāmavāṃ ibhena |\ntṛṣvīm anu prasitiṃ drūṇāno 'stāsi vidhya rakṣasas tapiṣṭhaiḥ ||",
          "english_griffith": "PUT forth like a wide-spreading net thy vigour; go like a mighty King with his attendants.\nThou, following thy swift net, shootest arrows: transfix the fiends with darts that burn most fiercely."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "तव भरमास आशुया पतन्त्य अनु सप्र्श धर्षता शोशुचानः |\nतपूंष्य अग्ने जुह्वा पतंगान असंदितो वि सर्ज विष्वग उल्काः ||",
          "sanskrit_iast": "tava bhramāsa āśuyā patanty anu spṛśa dhṛṣatā śośucānaḥ |\ntapūṃṣy aghne juhvā pataṃghān asaṃdito vi sṛja viṣvagh ulkāḥ ||",
          "english_griffith": "Forth go in rapid flight thy whirling weapons: follow them closely, glowing in thy fury.\nSpread with thy tongue the winged flames, O Agni; unfettered, cast thy firebrands all around thee."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "परति सपशो वि सर्ज तूर्णितमो भवा पायुर विशो अस्या अदब्धः |\nयो नो दूरे अघशंसो यो अन्त्य अग्ने माकिष टे वयथिर आ दधर्षीत ||",
          "sanskrit_iast": "prati spaśo vi sṛja tūrṇitamo bhavā pāyur viśo asyā adabdhaḥ |\nyo no dūre aghaśaṃso yo anty aghne mākiṣ ṭe vyathir ā dadharṣīt ||",
          "english_griffith": "Send thy spies forward, fleetest in thy motion; be, ne’er deceived, the guardian of this people\nFrom him who, near or far, is bent on evil, and let no trouble sent from thee o’ercome us."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "उद अग्ने तिष्ठ परत्य आ तनुष्व नय अमित्रां ओषतात तिग्महेते |\nयो नो अरातिं समिधान चक्रे नीचा तं धक्ष्य अतसं न शुष्कम ||",
          "sanskrit_iast": "ud aghne tiṣṭha praty ā tanuṣva ny amitrāṃ oṣatāt tighmahete |\nyo no arātiṃ samidhāna cakre nīcā taṃ dhakṣy atasaṃ na śuṣkam ||",
          "english_griffith": "Rise up, O Agni, spread thee out before us: burn down our foes, thou who hast sharpened arrows.\nHim, blazing Agni! who hath worked us mischief, consume thou utterly like dried-up stubble."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "ऊर्ध्वो भव परति विध्याध्य अस्मद आविष कर्णुष्व दैव्यान्य अग्ने |\nअव सथिरा तनुहि यातुजूनां जामिम अजामिम पर मर्णीहि शत्रून ||",
          "sanskrit_iast": "ūrdhvo bhava prati vidhyādhy asmad āviṣ kṛṇuṣva daivyāny aghne |\nava sthirā tanuhi yātujūnāṃ jāmim ajāmim pra mṛṇīhi śatrūn ||",
          "english_griffith": "Rise, Agni, drive off those who fight against us: make manifest thine own celestial vigour.\nSlacken the strong bows of the demon-driven: destroy our foemen whether kin or stranger."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "स ते जानाति सुमतिं यविष्ठ य ईवते बरह्मणे गातुम ऐरत |\nविश्वान्य अस्मै सुदिनानि रायो दयुम्नान्य अर्यो वि दुरो अभि दयौत ||",
          "sanskrit_iast": "sa te jānāti sumatiṃ yaviṣṭha ya īvate brahmaṇe ghātum airat |\nviśvāny asmai sudināni rāyo dyumnāny aryo vi duro abhi dyaut ||",
          "english_griffith": "Most Youthful God, he knoweth well thy favour who gave an impulse to this high devotion.\nAll fair days and magnificence of riches hast thou beamed forth upon the good man's portals."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "सेद अग्ने अस्तु सुभगः सुदानुर यस तवा नित्येन हविषा य उक्थैः |\nपिप्रीषति सव आयुषि दुरोणे विश्वेद अस्मै सुदिना सासद इष्टिः ||",
          "sanskrit_iast": "sed aghne astu subhaghaḥ sudānur yas tvā nityena haviṣā ya ukthaiḥ |\npiprīṣati sva āyuṣi duroṇe viśved asmai sudinā sāsad iṣṭiḥ ||",
          "english_griffith": "Blest, Agni, be the man, the liberal giver, who with his lauds and regular oblation\nIs fain to please thee for his life and dwelling. May all his days be bright: be this his longing."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "अर्चामि ते सुमतिं घोष्य अर्वाक सं ते वावाता जरताम इयं गीः |\nसवश्वास तवा सुरथा मर्जयेमास्मे कषत्राणि धारयेर अनु दयून ||",
          "sanskrit_iast": "arcāmi te sumatiṃ ghoṣy arvāk saṃ te vāvātā jaratām iyaṃ ghīḥ |\nsvaśvās tvā surathā marjayemāsme kṣatrāṇi dhārayer anu dyūn ||",
          "english_griffith": "I praise thy gracious favour: sing in answer. May this my song sing like a loved one with thee.\nLords of good steeds and cars may we adorn thee, and day by day vouchsafe thou us dominion."
        },
        {
          "verse": 9,
          "sanskrit_devanagari": "इह तवा भूर्य आ चरेद उप तमन दोषावस्तर दीदिवांसम अनु दयून |\nकरीळन्तस तवा सुमनसः सपेमाभि दयुम्ना तस्थिवांसो जनानाम ||",
          "sanskrit_iast": "iha tvā bhūry ā cared upa tman doṣāvastar dīdivāṃsam anu dyūn |\nkrīḷantas tvā sumanasaḥ sapemābhi dyumnā tasthivāṃso janānām ||",
          "english_griffith": "Here of free choice let each one serve thee richly, resplendent day by day at eve and morning.\nSo may we honour thee, content and joyous, passing beyond the glories of the people."
        },
        {
          "verse": 10,
          "sanskrit_devanagari": "यस तवा सवश्वः सुहिरण्यो अग्न उपयाति वसुमता रथेन |\nतस्य तराता भवसि तस्य सखा यस त आतिथ्यम आनुषग जुजोषत ||",
          "sanskrit_iast": "yas tvā svaśvaḥ suhiraṇyo aghna upayāti vasumatā rathena |\ntasya trātā bhavasi tasya sakhā yas ta ātithyam ānuṣagh jujoṣat ||",
          "english_griffith": "Whoso with good steeds and fine gold, O Agni, comes nigh thee on a car laden with treasure,\nHis Friend art thou, yea, thou art his Protector whose joy it is to entertain thee duly."
        },
        {
          "verse": 11,
          "sanskrit_devanagari": "महो रुजामि बन्धुता वचोभिस तन मा पितुर गोतमाद अन्व इयाय |\nतवं नो अस्य वचसश चिकिद्धि होतर यविष्ठ सुक्रतो दमूनाः ||",
          "sanskrit_iast": "maho rujāmi bandhutā vacobhis tan mā pitur ghotamād anv iyāya |\ntvaṃ no asya vacasaś cikiddhi hotar yaviṣṭha sukrato damūnāḥ ||",
          "english_griffith": "Through words and kinship I destroy the mighty: this power I have from Gotama my father.\nMark thou this speech of ours, O thou Most Youthful, Friend of the House, exceeding wise, Invoker."
        },
        {
          "verse": 12,
          "sanskrit_devanagari": "अस्वप्नजस तरणयः सुशेवा अतन्द्रासो ऽव्र्का अश्रमिष्ठाः |\nते पायवः सध्र्यञ्चो निषद्याग्ने तव नः पान्त्व अमूर ||",
          "sanskrit_iast": "asvapnajas taraṇayaḥ suśevā atandrāso 'vṛkā aśramiṣṭhāḥ |\nte pāyavaḥ sadhryañco niṣadyāghne tava naḥ pāntv amūra ||",
          "english_griffith": "Knowing no slumber, speedy and propitious, alert and ever friendly, most unwearied,\nMay thy protecting powers, unerring Agni, taking their places here, combined, preserve us."
        },
        {
          "verse": 13,
          "sanskrit_devanagari": "ये पायवो मामतेयं ते अग्ने पश्यन्तो अन्धं दुरिताद अरक्षन |\nररक्ष तान सुक्र्तो विश्ववेदा दिप्सन्त इद रिपवो नाह देभुः ||",
          "sanskrit_iast": "ye pāyavo māmateyaṃ te aghne paśyanto andhaṃ duritād arakṣan |\nrarakṣa tān sukṛto viśvavedā dipsanta id ripavo nāha debhuḥ ||",
          "english_griffith": "Thy guardian rays, O Agni, when they saw him, preserved blind Māmateya from affliction.\nLord of all riches, he preserved the pious: the foes who fain would harm them did no mischief."
        },
        {
          "verse": 14,
          "sanskrit_devanagari": "तवया वयं सधन्यस तवोतास तव परणीत्य अश्याम वाजान |\nउभा शंसा सूदय सत्यताते ऽनुष्ठुया कर्णुह्य अह्रयाण ||",
          "sanskrit_iast": "tvayā vayaṃ sadhanyas tvotās tava praṇīty aśyāma vājān |\nubhā śaṃsā sūdaya satyatāte 'nuṣṭhuyā kṛṇuhy ahrayāṇa ||",
          "english_griffith": "Aided by thee with thee may we be wealthy, may we gain strength with thee to guide us onward.\nFulfil the words of both, O Ever Truthful: straightway do this, thou God whom power emboldens."
        },
        {
          "verse": 15,
          "sanskrit_devanagari": "अया ते अग्ने समिधा विधेम परति सतोमं शस्यमानं गर्भाय |\nदहाशसो रक्षसः पाह्य अस्मान दरुहो निदो मित्रमहो अवद्यात ||",
          "sanskrit_iast": "ayā te aghne samidhā vidhema prati stomaṃ śasyamānaṃ ghṛbhāya |\ndahāśaso rakṣasaḥ pāhy asmān druho nido mitramaho avadyāt ||",
          "english_griffith": "O Agni, with this fuel will we serve thee; accept the laud we sing to thee with favour\nDestroy the cursing Rākṣasas: preserve us, O rich in friends, from guile and scorn and slander."
        }
      ]
    },
    {
      "sukta": 5,
      "deity_english": "Agni (Vaiśvānara)",
      "deity_sanskrit": "अग्नि (वैश्वानर)",
      "rishi_english": "Vāmadeva",
      "rishi_sanskrit": "वामदेव",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "वैश्वानराय मीळ्हुषे सजोषाः कथा दाशेमाग्नये बर्हद भाः |\nअनूनेन बर्हता वक्षथेनोप स्तभायद उपमिन न रोधः ||",
          "sanskrit_iast": "vaiśvānarāya mīḷhuṣe sajoṣāḥ kathā dāśemāghnaye bṛhad bhāḥ |\nanūnena bṛhatā vakṣathenopa stabhāyad upamin na rodhaḥ ||",
          "english_griffith": "How shall we give with one accord oblation to Agni, to Vaiśvānara the Bounteous? Great light, with full high growth hath he uplifted, and, as a pillar bears the roof, sustains it."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "मा निन्दत य इमाम मह्यं रातिं देवो ददौ मर्त्याय स्वधावान |\nपाकाय गर्त्सो अम्र्तो विचेता वैश्वानरो नर्तमो यह्वो अग्निः ||",
          "sanskrit_iast": "mā nindata ya imām mahyaṃ rātiṃ devo dadau martyāya svadhāvān |\npākāya ghṛtso amṛto vicetā vaiśvānaro nṛtamo yahvo aghniḥ ||",
          "english_griffith": "Reproach not him who, God and self-reliant, vouchsafed this bounty unto me a mortal,— Deathless, discerner, wise, to me the simple, Vaiśvānara most manly, youthful Agni."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "साम द्विबर्हा महि तिग्मभ्र्ष्टिः सहस्ररेता वृषभस तुविष्मान |\nपदं न गोर अपगूळ्हं विविद्वान अग्निर मह्यम प्रेद उ वोचन मनीषाम ||",
          "sanskrit_iast": "sāma dvibarhā mahi tighmabhṛṣṭiḥ sahasraretā vṛṣabhas tuviṣmān |\npadaṃ na ghor apaghūḷhaṃ vividvān aghnir mahyam pred u vocan manīṣām ||",
          "english_griffith": "Sharp-pointed, powerful, strong, of boundless vigour, Agni who knows the lofty hymn, kept secret As the lost milch-cow's track, the doubly Mighty,—he hath declared to me this hidden knowledge."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "प्र तां अग्निर बभसत तिग्मजम्भस तपिष्ठेन शोचिषा यः सुराधाः |\nप्र ये मिनन्ति वरुणस्य धाम प्रिया मित्रस्य चेततो धरुवाणि ||",
          "sanskrit_iast": "pra tāṃ aghnir babhasat tighmajambhas tapiṣṭhena śociṣā yaḥ surādhāḥ |\npra ye minanti varuṇasya dhāma priyā mitrasya cetato dhruvāṇi ||",
          "english_griffith": "May he with sharpened teeth, the Bounteous Giver, Agni, consume with flame most fiercely glowing. Those who regard not Varuṇa's commandments and the dear stedfast laws of sapient Mitra."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "अभ्रातरो न योषणो वयन्तः पतिरिपो न जनयो दुरेवाः |\nपापासः सन्तो अन्र्ता असत्या इदम पदम अजनता गभीरम ||",
          "sanskrit_iast": "abhrātaro na yoṣaṇo vyantaḥ patiripo na janayo durevāḥ |\npāpāsaḥ santo anṛtā asatyā idam padam ajanatā ghabhīram ||",
          "english_griffith": "Like youthful women without brothers, straying, like dames who hate their lords, of evil conduct, They who are full of sin, untrue, unfaithful, they have engendered this abysmal station."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "इदम मे अग्ने कियते पावकामिनते गुरुम भारं न मन्म |\nबर्हद दधाथ धर्षता गभीरं यह्वम पर्ष्ठम परयसा सप्तधातु ||",
          "sanskrit_iast": "idam me aghne kiyate pāvakāminate ghurum bhāraṃ na manma |\nbṛhad dadhātha dhṛṣatā ghabhīraṃ yahvam pṛṣṭham prayasā saptadhātu ||",
          "english_griffith": "To me, weak, innocent, thou, luminous Agni, hast boldly given as ’twere a heavy burthen, This Pṛṣṭha hymn, profound and strong and mighty, of seven elements, and with offered dainties."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "तम इन नव एव समना समानम अभि करत्वा पुनती धीतिर अश्याः |\nससस्य चर्मन्न अधि चारु पर्श्नेर अग्रे रुप आरुपितं जबारु ||",
          "sanskrit_iast": "tam in nv eva samanā samānam abhi kratvā punatī dhītir aśyāḥ |\nsasasya carmann adhi cāru pṛśner aghre rupa ārupitaṃ jabāru ||",
          "english_griffith": "So may our song that purifies, through wisdom reach in a moment him the Universal, Established on the height, on earth's best station, above the beauteous grassy skin of Pṛśni."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "परवाच्यं वचसः किम मे अस्य गुहा हितम उप निणिग वदन्ति |\nयद उस्रियाणाम अप वार इव वरन पाति परियं रुपो अग्रम पदं वेः ||",
          "sanskrit_iast": "pravācyaṃ vacasaḥ kim me asya ghuhā hitam upa niṇigh vadanti |\nyad usriyāṇām apa vār iva vran pāti priyaṃ rupo aghram padaṃ veḥ ||",
          "english_griffith": "Of this my speech what shall I utter further? They indicate the milk stored up in secret When they have thrown as ’twere the cows' stalls open. The Bird protects earths’ best and well-loved station."
        },
        {
          "verse": 9,
          "sanskrit_devanagari": "इदम उ तयन महि महाम अनीकं यद उस्रिया सचत पूर्व्यं गौः |\nरतस्य पदे अधि दीद्यानं गुहा रघुष्यद रघुयद विवेद ||",
          "sanskrit_iast": "idam u tyan mahi mahām anīkaṃ yad usriyā sacata pūrvyaṃ ghauḥ |\nṛtasya pade adhi dīdyānaṃ ghuhā raghuṣyad raghuyad viveda ||",
          "english_griffith": "This is the Great Ones’ mighty apparition which from of old the radiant Cow hath followed. This, shining brightly in the place of Order, swift, hasting on in secret, she discovered."
        },
        {
          "verse": 10,
          "sanskrit_devanagari": "अध दयुतानः पित्रोः सचासामनुत गुह्यं चारु पर्श्नेः |\nमातुष पदे परमे अन्ति षद गोर वर्ष्णः शोचिषः परयतस्य जिह्वा ||",
          "sanskrit_iast": "adha dyutānaḥ pitroḥ sacāsāmanuta ghuhyaṃ cāru pṛśneḥ |\nmātuṣ pade parame anti ṣad ghor vṛṣṇaḥ śociṣaḥ prayatasya jihvā ||",
          "english_griffith": "He then who shone together with his Parents remembered Pṛśni's fair and secret treasure, Which, in the Mother Cow's most lofty station, the Bull's tongue, of the flame bent forward, tasted."
        },
        {
          "verse": 11,
          "sanskrit_devanagari": "रतं वोचे नमसा पर्छ्यमानस तवाशसा जातवेदो यदीदम |\nतवम अस्य कषयसि यद ध विश्वं दिवि यद उ दरविणं यत पर्थिव्याम ||",
          "sanskrit_iast": "ṛtaṃ voce namasā pṛchyamānas tavāśasā jātavedo yadīdam |\ntvam asya kṣayasi yad dha viśvaṃ divi yad u draviṇaṃ yat pṛthivyām ||",
          "english_griffith": "With reverence I declare the Law, O Agni; what is, comes by thine order, Jātavedas. Of this, whate’er it be, thou art the Sovran, yea, all the wealth that is in earth or heaven."
        },
        {
          "verse": 12,
          "sanskrit_devanagari": "किं नो अस्य दरविणं कद ध रत्नं वि नो वोचो जातवेदश चिकित्वान |\nगुहाध्वनः परमं यन नो अस्य रेकु पदं न निदाना अगन्म ||",
          "sanskrit_iast": "kiṃ no asya draviṇaṃ kad dha ratnaṃ vi no voco jātavedaś cikitvān |\nghuhādhvanaḥ paramaṃ yan no asya reku padaṃ na nidānā aghanma ||",
          "english_griffith": "What is our wealth therefrom, and what our treasure? Tell us O Jātavedas, for thou knowest, What is our best course in this secret passage: we, unreproached, have reached a place far distant."
        },
        {
          "verse": 13,
          "sanskrit_devanagari": "का मर्यादा वयुना कद ध वामम अछा गमेम रघवो न वाजम |\nकदा नो देवीर अम्र्तस्य पत्नीः सूरो वर्णेन ततनन्न उषासः ||",
          "sanskrit_iast": "kā maryādā vayunā kad dha vāmam achā ghamema raghavo na vājam |\nkadā no devīr amṛtasya patnīḥ sūro varṇena tatanann uṣāsaḥ ||",
          "english_griffith": "What is the limit, what the rules, the guerdon? Like fleet-foot coursers speed we to the contest. When will the Goddesses, the Immortal's Spouses, the Dawns, spread over us the Sun-God's splendour?"
        },
        {
          "verse": 14,
          "sanskrit_devanagari": "अनिरेण वचसा फल्ग्वेन परतीत्येन कर्धुनात्र्पासः |\nअधा ते अग्ने किम इहा वदन्त्य अनायुधास आसता सचन्ताम ||",
          "sanskrit_iast": "anireṇa vacasā phalghvena pratītyena kṛdhunātṛpāsaḥ |\nadhā te aghne kim ihā vadanty anāyudhāsa āsatā sacantām ||",
          "english_griffith": "Unsatisfied, with speech devoid of vigour, scanty and frivolous and inconclusive, Wherefore do they address thee here, O Agni? Let these who have no weapons suffer sorrow."
        },
        {
          "verse": 15,
          "sanskrit_devanagari": "अस्य शरिये समिधानस्य वर्ष्णो वसोर अनीकं दम आ रुरोच |\nरुशद वसानः सुद्र्शीकरूपः कषितिर न राया पुरुवारो अद्यौत ||",
          "sanskrit_iast": "asya śriye samidhānasya vṛṣṇo vasor anīkaṃ dama ā ruroca |\nruśad vasānaḥ sudṛśīkarūpaḥ kṣitir na rāyā puruvāro adyaut ||",
          "english_griffith": "The majesty of him the Good, the Mighty, aflame, hath shone for glory in the dwelling. He, clothed in light, hath shone most fair to look on, wealthy in boons, as a home shines with riches."
        }
      ]
    },
    {
      "sukta": 6,
      "deity_english": "Agni (Hotṛ)",
      "deity_sanskrit": "अग्नि (होतृ)",
      "rishi_english": "Bharadvāja Bārhaspatya",
      "rishi_sanskrit": "भरद्वाज बार्हस्पत्य",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "ऊर्ध्व ऊ षु णो अध्वरस्य होतर अग्ने तिष्ठ देवताता यजीयान ।\nतवं हि विश्वम अभ्य असि मन्म प्र वेधसश चित तिरसि मनीषाम ॥",
          "sanskrit_iast": "ūrdhva ū ṣu ṇo adhvarasya hotar aghne tiṣṭha devatātā yajīyān |\ntvaṃ hi viśvam abhy asi manma pra vedhasaś cit tirasi manīṣām ||",
          "english_griffith": "PRIEST of our rite, stand up erect, O Agni, in the Gods’ service best of sacrificers, For over every thought thou art the Ruler: thou furtherest e’en the wisdom of the pious."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "अमूरो होता नय असादि विक्ष्व अग्निर मन्द्रो विदथेषु परचेताः ।\nऊर्ध्वम भानुं सवितेवाश्रेन मेतेव धूमं सतभायद उप दयाम ॥",
          "sanskrit_iast": "amūro hotā ny asādi vikṣv aghnir mandro vidatheṣu pracetāḥ |\nūrdhvam bhānuṃ savitevāśren meteva dhūmaṃ stabhāyad upa dyām ||",
          "english_griffith": "He was set down mid men as Priest unerring, Agni, wise, welcome in our holy synods. Like Savitar he hath lifted up his splendour, and like a builder raised his smoke to heaven."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "यता सुजूर्णी रातिनी घर्ताची परदक्षिणिद देवतातिम उराणः ।\nउद उ सवरुर नवजा नाक्रः पश्वो अनक्ति सुधितः सुमेकः ॥",
          "sanskrit_iast": "yatā sujūrṇī rātinī ghṛtācī pradakṣiṇid devatātim urāṇaḥ |\nud u svarur navajā nākraḥ paśvo anakti sudhitaḥ sumekaḥ ||",
          "english_griffith": "The glowing ladle, filled with oil, is lifted; choosing Gods’ service to the right he circles. Eager he rises like the new-wrought pillar which, firmly set and fixed, anoints the victims."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "सतीर्णे बर्हिषि समिधाने अग्ना ऊर्ध्वो अध्वर्युर जुजुषाणो अस्थात ।\nपर्य अग्निः पशुपा न होता तरिविष्ट्य एति परदिव उराणः ॥",
          "sanskrit_iast": "stīrṇe barhiṣi samidhāne aghnā ūrdhvo adhvaryur jujuṣāṇo asthāt |\npary aghniḥ paśupā na hotā triviṣṭy eti pradiva urāṇaḥ ||",
          "english_griffith": "When sacred grass is strewn and Agni kindled, the Adhvaryu rises to his task rejoicing. Agni the Priest, like one who tends the cattle, goes three times round, as from of old he wills it."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "परि तमना मितद्रुर एति होताग्निर मन्द्रो मधुवचा रतावा ।\nदरवन्त्य अस्य वाजिनो न शोका भयन्ते विश्वा भुवना यद अभ्राट ॥",
          "sanskrit_iast": "pari tmanā mitadrur eti hotāghnir mandro madhuvacā ṛtāvā |\ndravanty asya vājino na śokā bhayante viśvā bhuvanā yad abhrāṭ ||",
          "english_griffith": "Agni himself, the Priest, with measured motion, goes round, with sweet speech, cheerful, true to Order. His fulgent flames run forth like vigorous horses; all creatures are affrighted when he blazes."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "भद्रा ते अग्ने सवनीक संद्र्ग घोरस्य सतो विषुणस्य चारुः ।\nन यत ते शोचिस तमसा वरन्त न धवस्मानस तन्व रेप आ धुः ॥",
          "sanskrit_iast": "bhadrā te aghne svanīka saṃdṛgh ghorasya sato viṣuṇasya cāruḥ |\nna yat te śocis tamasā varanta na dhvasmānas tanv repa ā dhuḥ ||",
          "english_griffith": "Beautiful and auspicious is thine aspect, O lovely Agni, terrible when spreading. Thy splendours are not covered by the darkness: detraction leaves no stain upon thy body."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "न यस्य सातुर जनितोर अवारि न मातरापितरा नू चिद इष्टौ ।\nअधा मित्रो न सुधितः पावको ऽगनिर दीदाय मानुषीषु विक्षु ॥",
          "sanskrit_iast": "na yasya sātur janitor avāri na mātarāpitarā nū cid iṣṭau |\nadhā mitro na sudhitaḥ pāvako 'ghnir dīdāya mānuṣīṣu vikṣu ||",
          "english_griffith": "Naught hindered his production, Bounteous Giver: his Mother and his Sire were free to send him. Then as Friend benevolent, refulgent, Agni shone forth in human habitations."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "दविर यम पञ्च जीजनन संवसानाः सवसारो अग्निम मानुषीषु विक्षु ।\nउषर्बुधम अथर्यो न दन्तं शुक्रं सवासम परशुं न तिग्मम ॥",
          "sanskrit_iast": "dvir yam pañca jījanan saṃvasānāḥ svasāro aghnim mānuṣīṣu vikṣu |\nuṣarbudham atharyo na dantaṃ śukraṃ svāsam paraśuṃ na tighmam ||",
          "english_griffith": "He, Agni, whom the twice-five sisters, dwelling together, in the homes of men engendered, Bright like a spear's tooth, wakened in the morning, with powerful mouth and like an axe well-sharpened."
        },
        {
          "verse": 9,
          "sanskrit_devanagari": "तव तये अग्ने हरितो घर्तस्ना रोहितास रज्वञ्चः सवञ्चः ।\nअरुषासो वर्षण रजुमुष्का आ देवतातिम अह्वन्त दस्माः ॥",
          "sanskrit_iast": "tava tye aghne harito ghṛtasnā rohitāsa ṛjvañcaḥ svañcaḥ |\naruṣāso vṛṣaṇa ṛjumuṣkā ā devatātim ahvanta dasmāḥ ||",
          "english_griffith": "These thy Bay Coursers, Agni, dropping fatness, ruddy vigorous, speeding straightly forward, And red steeds, wonderful, of mighty muscle, are to this service of the Gods invited."
        },
        {
          "verse": 10,
          "sanskrit_devanagari": "ये ह तये ते सहमाना अयासस तवेषासो अग्ने अर्चयश चरन्ति ।\nशयेनासो न दुवसनासो अर्थं तुविष्वणसो मारुतं न शर्धः ॥",
          "sanskrit_iast": "ye ha tye te sahamānā ayāsas tveṣāso aghne arcayaś caranti |\nśyenāso na duvasanāso arthaṃ tuviṣvaṇaso mārutaṃ na śardhaḥ ||",
          "english_griffith": "These brightly-shining games of thine, O Agni, that move for ever restless, all-subduing, Like falcons hasting eagerly to the quarry, roar loudly like the army of the Maruts."
        },
        {
          "verse": 11,
          "sanskrit_devanagari": "अकारि बरह्म समिधान तुभ्यं शंसात्य उक्थं यजते वय धाः ।\nहोतारम अग्निम मनुषो नि षेदुर नमस्यन्त उशिजः शंसम आयोः ॥",
          "sanskrit_iast": "akāri brahma samidhāna tubhyaṃ śaṃsāty ukthaṃ yajate vy dhāḥ |\nhotāram aghnim manuṣo ni ṣedur namasyanta uśijaḥ śaṃsam āyoḥ ||",
          "english_griffith": "To thee, O flaming God, hath prayer been offered. Let the priest laud thee: give to him who worships. Men have established Agni as Invoker, fain to adore the glory of the living."
        }
      ]
    },
    {
      "sukta": 7,
      "deity_english": "Agni (Hotṛ)",
      "deity_sanskrit": "अग्नि (होतृ)",
      "rishi_english": "Bharadvāja Bārhaspatya",
      "rishi_sanskrit": "भरद्वाज बार्हस्पत्य",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "अयम इह परथमो धायि धात्र्भिर होता यजिष्ठो अध्वरेष्व ईड्यः ।\nयम अप्नवानो भर्गवो विरुरुचुर वनेषु चित्रं विभ्वं विशे-विशे ॥",
          "sanskrit_iast": "ayam iha prathamo dhāyi dhātṛbhir hotā yajiṣṭho adhvareṣv īḍyaḥ |\nyam apnavāno bhṛghavo virurucur vaneṣu citraṃ vibhvaṃ viśe-viśe ||",
          "english_griffith": "HERE by ordainers was this God appointed first Invoker, best at worship, to be praised at rites: Whom Apnavāna, and the Bhṛgus caused to shine bright-coloured in the wood, spreading from home to home."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "अग्ने कदा त आनुषग भुवद देवस्य चेतनम ।\nअधा हि तवा जग्र्भ्रिरे मर्तासो विक्ष्व ईड्यम ॥",
          "sanskrit_iast": "aghne kadā ta ānuṣagh bhuvad devasya cetanam |\nadhā hi tvā jaghṛbhrire martāso vikṣv īḍyam ||",
          "english_griffith": "When shall thy glory as a God, Agni, be suddenly shown forth. For mortal men have held thee fast, adorable in all their homes,"
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "रतावानं विचेतसम पश्यन्तो दयाम इव सत्र्भिः ।\nविश्वेषाम अध्वराणां हस्कर्तारं दमे-दमे ॥",
          "sanskrit_iast": "ṛtāvānaṃ vicetasam paśyanto dyām iva stṛbhiḥ |\nviśveṣām adhvarāṇāṃ haskartāraṃ dame-dame ||",
          "english_griffith": "Seeing thee faithful to the Law, most sapient, like the starry heaven, Illumining with cheerful ray each solemn rite in every house."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "आशुं दूतं विवस्वतो विश्वा यश चर्षणीर अभि ।\nआ जभ्रुः केतुम आयवो भर्गवाणं विशे-विशे ॥",
          "sanskrit_iast": "āśuṃ dūtaṃ vivasvato viśvā yaś carṣaṇīr abhi |\nā jabhruḥ ketum āyavo bhṛghavāṇaṃ viśe-viśe ||",
          "english_griffith": "Vivasvān's envoy living men have taken as their ensign, swift, The ruler over all mankind, moving like Bhṛgu in each home."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "तम ईं होतारम आनुषक चिकित्वांसं नि षेदिरे ।\nरण्वम पावकशोचिषं यजिष्ठं सप्त धामभिः ॥",
          "sanskrit_iast": "tam īṃ hotāram ānuṣak cikitvāṃsaṃ ni ṣedire |\nraṇvam pāvakaśociṣaṃ yajiṣṭhaṃ sapta dhāmabhiḥ ||",
          "english_griffith": "Him the intelligent have they placed duly as Invoking Priest, Welcome, with sanctifying flame, best worshipper, with sevenfold might;"
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "तं शश्वतीषु मात्र्षु वन आ वीतम अश्रितम ।\nचित्रं सन्तं गुहा हितं सुवेदं कूचिदर्थिनम ॥",
          "sanskrit_iast": "taṃ śaśvatīṣu mātṛṣu vana ā vītam aśritam |\ncitraṃ santaṃ ghuhā hitaṃ suvedaṃ kūcidarthinam ||",
          "english_griffith": "In his Eternal Mothers, in the wood, concealed and unapproached, Kept secret though his flames are bright seeking on all sides, quickly found."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "ससस्य यद वियुता सस्मिन्न ऊधन्न रतस्य धामन रणयन्त देवाः ।\nमहां अग्निर नमसा रातहव्यो वेर अध्वराय सदम इद रतावा ॥",
          "sanskrit_iast": "sasasya yad viyutā sasminn ūdhann ṛtasya dhāman raṇayanta devāḥ |\nmahāṃ aghnir namasā rātahavyo ver adhvarāya sadam id ṛtāvā ||",
          "english_griffith": "That as food spreads forth in this earthly udder, Gods may rejoice them in the home of Order, Great Agni, served with reverence and oblation, flies ever to the sacrifice, the Faithful."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "वेर अध्वरस्य दूत्यानि विद्वान उभे अन्ता रोदसी संचिकित्वान ।\nदूत ईयसे परदिव उराणो विदुष्टरो दिव आरोधनानि ॥",
          "sanskrit_iast": "ver adhvarasya dūtyāni vidvān ubhe antā rodasī saṃcikitvān |\ndūta īyase pradiva urāṇo viduṣṭaro diva ārodhanāni ||",
          "english_griffith": "Bird of each rite, skilled in an envoy's duties, knowing both worlds and that which lies between them, Thou goest from of old a willing Herald, knowing full well heaven's innermost recesses."
        },
        {
          "verse": 9,
          "sanskrit_devanagari": "कर्ष्णं त एम रुशतः पुरो भाश चरिष्ण्व अर्चिर वपुषाम इद एकम ।\nयद अप्रवीता दधते ह गर्भं सद्यश चिज जातो भवसीद उ दूतः ॥",
          "sanskrit_iast": "kṛṣṇaṃ ta ema ruśataḥ puro bhāś cariṣṇv arcir vapuṣām id ekam |\nyad apravītā dadhate ha gharbhaṃ sadyaś cij jāto bhavasīd u dūtaḥ ||",
          "english_griffith": "Bright God, thy path is black: light is before thee: thy moving splendour is the chief of wonders. When she, yet unimpregnate, hath conceived thee, even when newly born thou art an envoy."
        },
        {
          "verse": 10,
          "sanskrit_devanagari": "सद्यो जातस्य दद्र्शानम ओजो यद अस्य वातो अनुवाति शोचिः ।\nवर्णक्ति तिग्माम अतसेषु जिह्वां सथिरा चिद अन्ना दयते वि जम्भैः ॥",
          "sanskrit_iast": "sadyo jātasya dadṛśānam ojo yad asya vāto anuvāti śociḥ |\nvṛṇakti tighmām ataseṣu jihvāṃ sthirā cid annā dayate vi jambhaiḥ ||",
          "english_griffith": "Yet newly born, his vigour is apparent when the wind blows upon his fiery splendour, His sharpened tongue he layeth on the brushwood, and with his teeth e’en solid food consumeth."
        },
        {
          "verse": 11,
          "sanskrit_devanagari": "तर्षु यद अन्ना तर्षुणा ववक्ष तर्षुं दूतं कर्णुते यह्वो अग्निः ।\nवातस्य मेळिं सचते निजूर्वन्न आशुं न वाजयते हिन्वे अर्वा ॥",
          "sanskrit_iast": "tṛṣu yad annā tṛṣuṇā vavakṣa tṛṣuṃ dūtaṃ kṛṇute yahvo aghniḥ |\nvātasya meḷiṃ sacate nijūrvann āśuṃ na vājayate hinve arvā ||",
          "english_griffith": "When he hath borne off food with swift flame swiftly, strong Agni makes himself a speedy envoy, Follows the rustling of the wind, consuming, and courser-like, speeds, drives the swift horse onward."
        }
      ]
    },
    {
      "sukta": 8,
      "deity_english": "Agni (Hotṛ)",
      "deity_sanskrit": "अग्नि (होतृ)",
      "rishi_english": "Bharadvāja Bārhaspatya",
      "rishi_sanskrit": "भरद्वाज बार्हस्पत्य",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "दूतं वो विश्ववेदसं हव्यवाहम अमर्त्यम |\nयजिष्ठम रञ्जसे गिरा ॥",
          "sanskrit_iast": "dūtaṃ vo viśvavedasaṃ havyavāham amartyam |\nyajiṣṭham ṛñjase ghirā ||",
          "english_griffith": "YOUR envoy who possesses all, Immortal, bearer of your gifts, Best worshipper, I woo with song."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "स हि वेदा वसुधितिम महां आरोधनं दिवः |\nस देवां एह वक्षति ॥",
          "sanskrit_iast": "sa hi vedā vasudhitim mahāṃ ārodhanaṃ divaḥ |\nsa devāṃ eha vakṣati ||",
          "english_griffith": "He, Mighty, knows the gift of wealth, he knows the deep recess of heaven: He shall bring hitherward the Gods."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "स वेद देव आनमं देवां रतायते दमे |\nदाति प्रियाणि चिद वसु ॥",
          "sanskrit_iast": "sa veda deva ānamaṃ devāṃ ṛtāyate dame |\ndāti priyāṇi cid vasu ||",
          "english_griffith": "He knows, a God himself, to guide Gods to the righteous in his home: He gives e’en treasures that we love."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "स होता सेद उ दूत्यं चिकित्वां अन्तर ईयते |\nविद्वां आरोधनं दिवः ॥",
          "sanskrit_iast": "sa hotā sed u dūtyaṃ cikitvāṃsaṃ antar īyate |\nvidvāṃ ārodhanaṃ divaḥ ||",
          "english_griffith": "He is the Herald: well-informed, he doth his errand to and fro, Knowing the deep recess of heaven."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "ते सयाम ये अग्नये ददाशुर हव्यदातिभिः |\nय ईम पुष्यन्त इन्धते ॥",
          "sanskrit_iast": "te syāma ye aghnaye dadāśur havyadātibhiḥ |\nya īm puṣyanta indhate ||",
          "english_griffith": "May we be they who gratify Agni with sacrificial gifts, Who cherish and enkindle him."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "ते राया ते सुवीर्यैः ससवांसो वि शर्ण्विरे |\nये अग्ना दधिरे दुवः ॥",
          "sanskrit_iast": "te rāyā te suvīryaiḥ sasavāṃso vi śṛṇvire |\nye aghnā dadhire duvaḥ ||",
          "english_griffith": "Illustrious for wealth are they, and hero deeds, victorious, Who have served Agni reverently."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "अस्मे रायो दिवे-दिवे सं चरन्तु पुरुस्प्र्हः |\nअस्मे वाजास ईरताम ॥",
          "sanskrit_iast": "asme rāyo dive-dive saṃ carantu puruspṛhaḥ |\nasme vājāsa īratām ||",
          "english_griffith": "So unto us, day after day, may riches craved by many come, And power and might spring up for us."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "स विप्रश चर्षणीनां शवसा मानुषाणाम |\nअति कषिप्रेव विध्यति ॥",
          "sanskrit_iast": "sa vipraś carṣaṇīnāṃ śavasā mānuṣāṇām |\nati kṣipreva vidhyati ||",
          "english_griffith": "That holy Singer in his strength shoots forth his arrows swifter than The swift shafts of the tribes of men."
        }
      ]
    },
    {
      "sukta": 9,
      "deity_english": "Agni (Hotṛ)",
      "deity_sanskrit": "अग्नि (होतृ)",
      "rishi_english": "Bharadvāja Bārhaspatya",
      "rishi_sanskrit": "भरद्वाज बार्हस्पत्य",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "अग्ने मर्ळ महां असि य ईम आ देवयुं जनम |\nइयेथ बर्हिर आसदम ॥",
          "sanskrit_iast": "aghne mṛḷa mahāṃ asi ya īm ā devayuṃ janam |\niyetha barhir āsadam ||",
          "english_griffith": "AGNI, show favour: great art thou who to this pious man art come, To seat thee on the sacred grass."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "स मानुषीषु दूळभो विक्षु परावीर अमर्त्यः |\nदूतो विश्वेषाम भुवत ॥",
          "sanskrit_iast": "sa mānuṣīṣu dūḷabho vikṣu prāvīr amartyaḥ |\ndūto viśveṣām bhuvat ||",
          "english_griffith": "May he the Immortal, Helper, bard to be deceived among mankind, Become the messenger of all."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "स सद्म परि णीयते होता मन्द्रो दिविष्टिषु |\nउत पोता नि षीदति ॥",
          "sanskrit_iast": "sa sadma pari ṇīyate hotā mandro diviṣṭiṣu |\nuta potā ni ṣīdati ||",
          "english_griffith": "Around the altar is he led, welcome Chief Priest at solemn rites, Or as the Potar sits him down."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "उत गना अग्निर अध्वर उतो गर्हपतिर दमे |\nउत बरह्मा नि षीदति ॥",
          "sanskrit_iast": "uta ghnā aghnir adhvara uto ghṛhapatir dame |\nuta brahmā ni ṣīdati ||",
          "english_griffith": "Agni in fire at sacrifice, and in the house as Lord thereof, And as a Brahman takes his seat."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "वेषि हय अध्वरीयताम उपवक्ता जनानाम |\nहव्या च मानुषाणाम ॥",
          "sanskrit_iast": "veṣi hy adhvarīyatām upavaktā janānām |\nhavyā ca mānuṣāṇām ||",
          "english_griffith": "Thou comest as the guide of folk who celebrate a sacrifice, And to oblations brought by men."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "वेषीद व अस्य दूत्यं यस्य जुजोषो अध्वरम |\nहव्यम मर्तस्य वोळ्हवे ॥",
          "sanskrit_iast": "veṣīd v asya dūtyaṃ yasya jujoṣo adhvaram |\nhavyam martasya voḷhave ||",
          "english_griffith": "Thou servest as his messenger whose sacrifice thou lovest well, To bear the mortal's gifts to heaven."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "अस्माकं जोष्य अध्वरम अस्माकं यज्ञम अङगिरः |\nअस्माकं शर्णुधी हवम ॥",
          "sanskrit_iast": "asmākaṃ joṣy adhvaram asmākaṃ yajñam aṅghiraḥ |\nasmākaṃ śṛṇudhī havam ||",
          "english_griffith": "Accept our solemn rite; be pleased, Aṅgiras, with our sacrifice: Give ear and listen to our call."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "परि ते दूळभो रथो ऽसमां अश्नोतु विश्वतः |\nयेन रक्षसि दाशुषः ॥",
          "sanskrit_iast": "pari te dūḷabho ratho 'smāṃ aśnotu viśvataḥ |\nyena rakṣasi dāśuṣaḥ ||",
          "english_griffith": "May thine inviolable car, wherewith thou guardest those who give, Come near to us from every side."
        }
      ]
    },
    {
      "sukta": 10,
      "deity_english": "Agni (Hotṛ)",
      "deity_sanskrit": "अग्नि (होतृ)",
      "rishi_english": "Bharadvāja Bārhaspatya",
      "rishi_sanskrit": "भरद्वाज बार्हस्पत्य",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "अग्ने तम अद्याश्वं न सतोमैः करतुं न भद्रं हर्दिस्प्र्शम |\nरध्यामा त ओहैः ॥",
          "sanskrit_iast": "aghne tam adyāśvaṃ na stomaiḥ kratuṃ na bhadraṃ hṛdispṛśam |\nṛdhyāmā ta ohaiḥ ||",
          "english_griffith": "This day with praises, Agni, we bring thee that which thou lovest. Right judgment, like a horse, with our devotions."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "अधा हय अग्ने करतोर भद्रस्य दक्षस्य साधोः |\nरथीर रतस्य बर्हतो बभूथ ॥",
          "sanskrit_iast": "adhā hy aghne krator bhadrasya dakṣasya sādhoḥ |\nrathīr ṛtasya bṛhato babhūtha ||",
          "english_griffith": "For thou hast ever been the Car-driver, Agni, of noble Strength, lofty sacrifice, and rightful judgment."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "एभिर नो अर्कैर भवा नो अर्वाङ सवर ण जयोतिः |\nअग्ने विश्वेभिः सुमना अनीकैः ॥",
          "sanskrit_iast": "ebhir no arkair bhavā no arvāṅ svar ṇa jyotiḥ |\naghne viśvebhiḥ sumanā anīkaiḥ ||",
          "english_griffith": "Through these our praises come thou to meet us, bright as the sunlight, O Agni, well disposed, with all thine aspects."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "आभिष टे अद्य गीर्भिर गर्णन्तो ऽगने दाशेम |\nपर ते दिवो न सतनयन्ति शुष्माः ॥",
          "sanskrit_iast": "ābhiṣ ṭe adya ghīrbhir ghṛṇanto 'ghne dāśema |\npra te divo na stanayanti śuṣmāḥ ||",
          "english_griffith": "Now may we serve thee singing these lauds this day to thee, Agni. Loud as the voice of Heaven thy blasts are roaring."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "तव सवादिष्ठाग्ने संद्र्ष्टिर इदा चिद अह्न इदा चिद अक्तोः |\nशरिये रुक्मो न रोचत उपाके ॥",
          "sanskrit_iast": "tava svādiṣṭhāghne saṃdṛṣṭir idā cid ahna idā cid aktoḥ |\nśriye rukmo na rocata upāke ||",
          "english_griffith": "Just at this time of the day and the night thy look is the sweetest: It shineth near us even as gold for glory."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "घर्तं न पूतं तनूर अरेपाः शुचि हिरण्यम |\nतत ते रुक्मो न रोचत सवधावः ॥",
          "sanskrit_iast": "ghṛtaṃ na pūtaṃ tanūr arepāḥ śuci hiraṇyam |\ntat te rukmo na rocata svadhāvaḥ ||",
          "english_griffith": "Spotless thy body, brilliant as gold, like clarified butter: This gleams like gold on thee, O Self-dependent."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "कर्तं चिद धि षमा सनेमि दवेषो ऽगन इनोषि मर्तात |\nइत्था यजमानाद रतावः ॥",
          "sanskrit_iast": "kṛtaṃ cid dhi ṣmā sanemi dveṣo 'ghna inoṣi martāt |\nitthā yajamānād ṛtāvaḥ ||",
          "english_griffith": "All hate and mischief, yea, if committed, Agni, thou turnest, Holy One, from the man who rightly worships."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "शिवा नः सख्या सन्तु भरात्राग्ने देवेषु युष्मे |\nसा नो नाभिः सदने सस्मिन्न ऊधन ॥",
          "sanskrit_iast": "śivā naḥ sakhyā santu bhrātrāghne deveṣu yuṣme |\nsā no nābhiḥ sadane sasminn ūdhan ||",
          "english_griffith": "Agni, with you Gods, prosperous be our friendships and kinships. Be this our bond here by this place, thine altar."
        }
      ]
    },
    {
      "sukta": 11,
      "deity_english": "Agni",
      "deity_sanskrit": "अग्नि",
      "rishi_english": "Bharadvāja Bārhaspatya",
      "rishi_sanskrit": "भरद्वाज बार्हस्पत्य",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "भद्रं ते अग्ने सहसिन्न अनीकम उपाक आ रोचते सूर्यस्य |\nरुशद दर्शे दद्र्शे नक्तया चिद अरूक्षितं दर्श आ रूपे अन्नम ||",
          "sanskrit_iast": "bhadraṃ te aghne sahasinn anīkam upāka ā rocate sūryasya |\nruśad dṛśe dadṛśe naktayā cid arūkṣitaṃ dṛśa ā rūpe annam ||",
          "english_griffith": "THY blessed majesty, victorious Agni, shines brightly in the neighbourhood of Sūrya. Splendid to see, it shows even at nighttime, and food is fair to look on in thy beauty."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "वि षाह्य अग्ने गर्णते मनीषां खं वेपसा तुविजात सतवानः |\nविश्वेभिर यद वावनः शुक्र देवैस तन नो रास्व सुमहो भूरि मन्म ||",
          "sanskrit_iast": "vi ṣāhy aghne ghṛṇate manīṣāṃ khaṃ vepasā tuvijāta stavānaḥ |\nviśvebhir yad vāvanaḥ śukra devais tan no rāsva sumaho bhūri manma ||",
          "english_griffith": "Agni, disclose his thought for him who singeth, the well, Strong God! while thou art praised with fervour. Vouchsafe to us that powerful hymn, O Mighty, which, Radiant One! with all the Gods thou lovest."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "तवद अग्ने काव्या तवन मनीषास तवद उक्था जायन्ते राध्यानि |\nतवद एति दरविणं वीरपेशा इत्थाधिये दाशुषे मर्त्याय ||",
          "sanskrit_iast": "tvad aghne kāvyā tvan manīṣās tvad ukthā jāyante rādhyāni |\ntvad eti draviṇaṃ vīrapeśā itthādhiye dāśuṣe martyāya ||",
          "english_griffith": "From thee, O Agni, springs poetic wisdom, from thee come thoughts and hymns of praise that prosper; From thee flows wealth, with heroes to adorn it, to the true-hearted man who gives oblation."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "तवद वाजी वाजम्भरो विहाया अभिष्टिक्र्ज जायते सत्यशुष्मः |\nतवद रयिर देवजूतो मयोभुस तवद आशुर जूजुवां अग्ने अर्वा ||",
          "sanskrit_iast": "tvad vājī vājambharo vihāyā abhiṣṭikṛj jāyate satyaśuṣmaḥ |\ntvad rayir devajūto mayobhus tvad āśur jūjuvāṃ aghne arvā ||",
          "english_griffith": "From thee the hero springs who wins the booty, bringer of help, mighty, of real courage. From thee comes wealth, sent by the Gods, bliss-giving; Agni, from thee the fleet impetuous charger."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "तवाम अग्ने परथमं देवयन्तो देवम मर्ता अम्र्त मन्द्रजिह्वम |\nदवेषोयुतम आ विवासन्ति धीभिर दमूनसं गर्हपतिम अमूरम ||",
          "sanskrit_iast": "tvām aghne prathamaṃ devayanto devam martā amṛta mandrajihvam |\ndveṣoyutam ā vivāsanti dhībhir damūnasaṃ ghṛhapatim amūram ||",
          "english_griffith": "Immortal Agni, thee whose voice is pleasant, as first in rank, as God, religious mortals Invite with hymns; thee who removest hatred, Friend of the Home, the household's Lord, unerring."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "आरे अस्मद अमतिम आरे अंह आरे विश्वां दुर्मतिं यन निपासि |\nदोषा शिवः सहसः सूनो अग्ने यं देव आ चित सचसे सवस्ति ||",
          "sanskrit_iast": "āre asmad amatim āre aṃha āre viśvāṃ durmatiṃ yan nipāsi |\ndoṣā śivaḥ sahasaḥ sūno aghne yaṃ deva ā cit sacase svasti ||",
          "english_griffith": "Far from us thou removest want and sorrow, far from us all ill-will when thou protectest. Son of Strength, Agni, blest is he at evening, whom thou as God attendest for his welfare."
        }
      ]
    },
    {
      "sukta": 12,
      "deity_english": "Agni",
      "deity_sanskrit": "अग्नि",
      "rishi_english": "Bharadvāja Bārhaspatya",
      "rishi_sanskrit": "भरद्वाज बार्हस्पत्य",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "यस तवाम अग्न इनधते यतस्रुक तरिस ते अन्नं कर्णवत सस्मिन्न अहन |\nस सु दयुम्नैर अभ्य अस्तु परसक्षत तव करत्वा जातवेदश चिकित्वान ||",
          "sanskrit_iast": "yas tvām aghna inadhate yatasruk tris te annaṃ kṛṇavat sasminn ahan |\nsa su dyumnair abhy astu prasakṣat tava kratvā jātavedaś cikitvān ||",
          "english_griffith": "WHOSO enkindles thee, with lifted ladle, and thrice this day offers thee food, O Agni, May he excel, triumphant through thy splendours, wise through thy mental power, O Jātavedas."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "इध्मं यस ते जभरच छश्रमाणो महो अग्ने अनीकम आ सपर्यन |\nस इधानः परति दोषाम उषासम पुष्यन रयिं सचते घनन्न अमित्रान ||",
          "sanskrit_iast": "idhmaṃ yas te jabharac chaśramāṇo maho aghne anīkam ā saparyan |\nsa idhānaḥ prati doṣām uṣāsam puṣyan rayiṃ sacate ghnann amitrān ||",
          "english_griffith": "Whoso with toil and trouble brings thee fuel, serving the majesty of mighty Agni, He, kindling thee at evening and at morning, prospers, and comes to wealth, and slays his foemen."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "अग्निर ईशे बर्हतः कषत्रियस्याग्निर वाजस्य परमस्य रायः |\nदधाति रत्नं विधते यविष्ठो वय आनुषङ मर्त्याय सवधावान ||",
          "sanskrit_iast": "aghnir īśe bṛhataḥ kṣatriyasyāghnir vājasya paramasya rāyaḥ |\ndadhāti ratnaṃ vidhate yaviṣṭho vy ānuṣaṅ martyāya svadhāvān ||",
          "english_griffith": "Agni is Master of sublime dominion, Agni is Lord of strength and lofty riches. Straightway the self-reliant God, Most Youthful, gives treasures to the mortal who adores him."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "यच चिद धि ते पुरुषत्रा यविष्ठाचित्तिभिश चक्र्मा कच चिद आगः |\nकर्धी षव अस्मां अदितेर अनागान वय एनांसि शिश्रथो विष्वग अग्ने ||",
          "sanskrit_iast": "yac cid dhi te puruṣatrā yaviṣṭhācittibhiś cakṛmā kac cid āghaḥ |\nkṛdhī ṣv asmāṃ aditer anāghān vy enāṃsi śiśratho viṣvagh aghne ||",
          "english_griffith": "Most Youthful God, whatever sin, through folly, we here, as human beings, have committed, In sight of Aditi make thou us sinless remit, entirely, Agni, our offences."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "महश चिद अग्न एनसो अभीक ऊर्वाद देवानाम उत मर्त्यानाम |\nमा ते सखायः सदम इद रिषाम यछा तोकाय तनयाय शं योः ||",
          "sanskrit_iast": "mahaś cid aghna enaso abhīka ūrvād devānām uta martyānām |\nmā te sakhāyaḥ sadam id riṣāma yachā tokāya tanayāya śaṃ yoḥ ||",
          "english_griffith": "Even in the presence of great sin, O Agni, free us from prison of the Gods or mortals. Never may we who are thy friends be injured: grant health and strength unto our seed and offspring."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "यथा ह तयद वसवो गौर्यं चित पदि षिताम अमुञ्चता यजत्राः |\nएवो षव अस्मन मुञ्चता वय अंहः पर तार्य अग्ने परतरं न आयुः ||",
          "sanskrit_iast": "yathā ha tyad vasavo ghauryaṃ cit padi ṣitām amuñcatā yajatrāḥ |\nevo ṣv asman muñcatā vy aṃhaḥ pra tāry aghne prataraṃ na āyuḥ ||",
          "english_griffith": "Even as ye here, Gods Excellent and Holy, have loosed the cow that by the foot was tethered, So also set us free from this affliction long let our life, O Agni, be extended."
        }
      ]
    },
    {
      "sukta": 13,
      "deity_english": "Sūrya",
      "deity_sanskrit": "सूर्य",
      "rishi_sanskrit": "वामदेव गौतम",
      "rishi_english": "Vāmadeva Gautama",
      "chandas": "Trishtubh",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "परत्य अग्निर उषसाम अग्रम अख्यद विभातीनां सुमना रत्नधेयम |\nयातम अश्विना सुक्र्तो दुरोणम उत सूर्यो जयोतिषा देव एति ||",
          "sanskrit_iast": "praty aghnir uṣasām aghram akhyad vibhātīnāṃ sumanā ratnadheyam |\nyātam aśvinā sukṛto duroṇam ut sūryo jyotiṣā deva eti ||",
          "english_griffith": "AGNI hath looked, benevolently-minded, on the wealth-giving spring of radiant Mornings. Come, Aśvins, to the dwelling of the pious: Sūrya the God is rising with his splendour."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "ऊर्ध्वम भानुं सविता देवो अश्रेद दरप्सं दविध्वद गविषो न सत्वा |\nअनु वरतं वरुणो यन्ति मित्रो यत सूर्यं दिव्य आरोहयन्ति ||",
          "sanskrit_iast": "ūrdhvam bhānuṃ savitā devo aśred drapsaṃ davidhvad ghaviṣo na satvā |\nanu vrataṃ varuṇo yanti mitro yat sūryaṃ divy ārohayanti ||",
          "english_griffith": "Savitar, God, hath spread on high his lustre, waving his flag like a spoil-seeking hero. Their stablished way go Varuṇa and Mitra, what time they make the Sun ascend the heaven."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "यं सीम अक्र्ण्वन तमसे विप्र्चे धरुवक्षेमा अनवस्यन्तो अर्थम|\nतं सूर्यं हरितः सप्त यह्वी सपशं विश्वस्य जगतो वहन्ति ||",
          "sanskrit_iast": "yaṃ sīm akṛṇvan tamase vipṛce dhruvakṣemā anavasyanto artham|\ntaṃ sūryaṃ haritaḥ sapta yahvī spaśaṃ viśvasya jaghato vahanti ||",
          "english_griffith": "Him whom they made to drive away the darkness, Lords of sure mansions, constant to their object, Him who beholds the universe, the Sun-God, seven strong and youthful Coursers carry onward."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "वहिष्ठेभिर विहरन यासि तन्तुम अवव्ययन्न असितं देव वस्म |\nदविध्वतो रश्मयः सूर्यस्य चर्मेवावाधुस तमो अप्स्व अन्तः ||",
          "sanskrit_iast": "vahiṣṭhebhir viharan yāsi tantum avavyayann asitaṃ deva vasma |\ndavidhvato raśmayaḥ sūryasya carmevāvādhus tamo apsv antaḥ ||",
          "english_griffith": "Spreading thy web with mightiest Steeds thou comest, rending apart, thou God, the black-hued mantle. The rays of Sūrya tremulously shining sink, like a hide, the darkness in the waters."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "अनायतो अनिबद्धः कथायं नयङङ उत्तानो ऽव पद्यते न |",
          "sanskrit_iast": "anāyato anibaddhaḥ kathāyaṃ nyaṅṅ uttāno 'va padyate na |",
          "english_griffith": "How is it that, unbound and not supported, he falleth not although directed downward? By what self power moves he? Who hath seen it? He guards the vault of heaven, a close-set pillar."
        }
      ]
    },
    {
      "sukta": 14,
      "deity_english": "Agni, Savitar, Ashvins, Ushas, Surya",
      "deity_sanskrit": "अग्नि, सवितृ, अश्विनौ, उषस्, सूर्य",
      "rishi_english": "Vāmadeva Gautama",
      "rishi_sanskrit": "वामदेव गौतम",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "परत्य अग्निर उषसो जातवेदा अख्यद देवो रोचमाना महोभिः |\nआ नासत्योरुगाया रथेनेमं यज्ञम उप नो यातम अछ ||",
          "sanskrit_iast": "praty aghnir uṣaso jātavedā akhyad devo rocamānā mahobhiḥ |\nā nāsatyorughāyā rathenemaṃ yajñam upa no yātam acha ||",
          "english_griffith": "The God hath looked, even Agni Jātavedas, to meet the Dawns refulgent in their glories. Come on your chariot, ye who travel widely, come to this sacrifice of ours, Nāsatyas."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "ऊर्ध्वं केतुं सविता देवो अश्रेज जयोतिर विश्वस्मै भुवनाय कर्ण्वन |\nआप्रा दयावाप्र्थिवी अन्तरिक्षं वि सूर्यो रश्मिभिश चेकितानः ||",
          "sanskrit_iast": "ūrdhvaṃ ketuṃ savitā devo aśrej jyotir viśvasmai bhuvanāya kṛṇvan |\nāprā dyāvāpṛthivī antarikṣaṃ vi sūryo raśmibhiś cekitānaḥ ||",
          "english_griffith": "Producing light for all the world of creatures, God Savitar hath raised aloft his banner. Making his presence known by sunbeams, Sūrya hath filled the firmament and earth and heaven."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "आवहन्त्य अरुणीर जयोतिषागान मही चित्रा रश्मिभिश चेकिताना |\nपरबोधयन्ती सुविताय देव्य उषा ईयते सुयुजा रथेन ||",
          "sanskrit_iast": "āvahanty aruṇīr jyotiṣāghān mahī citrā raśmibhiś cekitānā |\nprabodhayantī suvitāya devy uṣā īyate suyujā rathena ||",
          "english_griffith": "Red Dawn is come, riding with brightness onward, distinguished by her beams, gay-hued and mighty. Dawn on her nobly-harnessed car, the Goddess, awaking men to happiness, approacheth."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "आ वां वहिष्ठा इह ते वहन्तु रथा अश्वास उषसो वयुष्टौ |\nइमे हि वाम मधुपेयाय सोमा अस्मिन यज्ञे वर्षणा मादयेथाम ||",
          "sanskrit_iast": "ā vāṃ vahiṣṭhā iha te vahantu rathā aśvāsa uṣaso vyuṣṭau |\nime hi vām madhupeyāya somā asmin yajñe vṛṣaṇā mādayethām ||",
          "english_griffith": "May those most powerful steeds and chariot bring you, O Aśvins, hither at the break of morning. Here for your draught of meath are Soma juices: at this our sacrifice rejoice, ye Mighty."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "अनायतो अनिबद्धः कथायं नयङङ उत्तानो ऽव पद्यते न |",
          "sanskrit_iast": "anāyato anibaddhaḥ kathāyaṃ nyaṅṅ uttāno 'va padyate na |",
          "english_griffith": "How is it that, unbound and unsupported, he falleth not although directed downward? By what self-power moves he? Who hath seen it? He guards the vault of heaven, a close-set pillar."
        }
      ]
    },
    {
      "sukta": 15,
      "deity_english": "Agni, Ashvins",
      "deity_sanskrit": "अग्नि, अश्विनौ",
      "rishi_english": "Vāmadeva Gautama",
      "rishi_sanskrit": "वामदेव गौतम",
      "mantras": [
        {
          "verse": 1,
          "sanskrit_devanagari": "अग्निर होता नो अध्वरे वाजी सन परि णीयते | देवो देवेषु यज्ञियः ||",
          "sanskrit_iast": "aghnir hotā no adhvare vājī san pari ṇīyate | devo deveṣu yajñiyaḥ ||",
          "english_griffith": "AGNI the Herald, like a horse, is led forth at our solemn rite, God among Gods adorable."
        },
        {
          "verse": 2,
          "sanskrit_devanagari": "परि तरिविष्ट्य अध्वरं यात्य अग्नी रथीर इव | आ देवेषु परयो दधत ||",
          "sanskrit_iast": "pari triviṣṭy adhvaraṃ yāty aghnī rathīr iva | ā deveṣu prayo dadhat ||",
          "english_griffith": "Three times unto our solemn rite comes Agni like a charioteer, Bearing the viands to the Gods."
        },
        {
          "verse": 3,
          "sanskrit_devanagari": "परि वाजपतिः कविर अग्निर हव्यान्य अक्रमीत | दधद रत्नानि दाशुषे ||",
          "sanskrit_iast": "pari vājapatiḥ kavir aghnir havyāny akramīt | dadhad ratnāni dāśuṣe ||",
          "english_griffith": "Round the oblations hath he paced, Agni the Wise, the Lord of Strength, Giving the offerer precious boons."
        },
        {
          "verse": 4,
          "sanskrit_devanagari": "अयं यः सर्ञ्जये पुरो दैववाते समिध्यते | दयुमां अमित्रदम्भनः ||",
          "sanskrit_iast": "ayaṃ yaḥ sṛñjaye puro daivavāte samidhyate | dyumāṃ amitradambhanaḥ ||",
          "english_griffith": "He who is kindled eastward for Sṛñjaya, Devāvata's son, Resplendent, tamer of the foe."
        },
        {
          "verse": 5,
          "sanskrit_devanagari": "अस्य घा वीर ईवतो ऽगनेर ईशीत मर्त्यः | तिग्मजम्भस्य मीळ्हुषः ||",
          "sanskrit_iast": "asya ghā vīra īvato 'ghner īśīta martyaḥ | tighmajambhasya mīḷhuṣaḥ ||",
          "english_griffith": "So mighty be the Agni whom the mortal hero shall command, With sharpened teeth and bountiful."
        },
        {
          "verse": 6,
          "sanskrit_devanagari": "तम अर्वन्तं न सानसिम अरुषं न दिवः शिशुम | मर्म्र्ज्यन्ते दिवे-दिवे ||",
          "sanskrit_iast": "tam arvantaṃ na sānasim aruṣaṃ na divaḥ śiśum | marmṛjyante dive-dive ||",
          "english_griffith": "Day after day they dress him, as they clean a horse who wins the prize. Dress the red Scion of the Sky."
        },
        {
          "verse": 7,
          "sanskrit_devanagari": "बोधद यन मा हरिभ्यां कुमारः साहदेव्यः | अछा न हूत उद अरम ||",
          "sanskrit_iast": "bodhad yan mā haribhyāṃ kumāraḥ sāhadevyaḥ | achā na hūta ud aram ||",
          "english_griffith": "When Sahadeva's princely son with two bay horses thought of me, Summoned by him I drew not back."
        },
        {
          "verse": 8,
          "sanskrit_devanagari": "उत तया यजता हरी कुमारात साहदेव्यात | परयता सद्य आ ददे ||",
          "sanskrit_iast": "uta tyā yajatā harī kumārāt sāhadevyāt | prayatā sadya ā dade ||",
          "english_griffith": "And truly those two noble bays I straightway took when offered me, From Sahadeva's princely son."
        },
        {
          "verse": 9,
          "sanskrit_devanagari": "एष वां देवाव अश्विना कुमारः साहदेव्यः | दीर्घायुर अस्तु सोमकः ||",
          "sanskrit_iast": "eṣa vāṃ devāv aśvinā kumāraḥ sāhadevyaḥ | dīrghāyur astu somakaḥ ||",
          "english_griffith": "Long, O ye Aśvins, may he live, your care, ye Gods, the princely son Of Sahadeva, Somaka."
        },
        {
          "verse": 10,
          "sanskrit_devanagari": "तं युवं देवाव अश्विना कुमारं साहदेव्यम | दीर्घायुषं कर्णोतन ||",
          "sanskrit_iast": "taṃ yuvaṃ devāv aśvinā kumāraṃ sāhadevyam | dīrghāyuṣaṃ kṛṇotana ||",
          "english_griffith": "Cause him the youthful prince, the son of Sahadeva, to enjoy Long life, O Aśvins, O ye Gods."
        }
      ]
    }

  ]
    }